import React from 'react';
import {
    Image,
    Platform,
    ScrollView,
    StyleSheet,
    Text,
    TouchableOpacity,
    View,
    TextInput,
    Button,
    Dimensions,
    AsyncStorage,
    Alert,
    ImageBackground,
    BackHandler
} from 'react-native';
import { WebBrowser } from 'expo';
import Images from 'react-native-scalable-image';
const { height, width } = Dimensions.get('window')
import HTML from 'react-native-render-html';
import { Constants } from 'expo';
import { CheckBox } from 'react-native-elements';

const html = `<p>
    เงอนไขการใชงาน
    ปรบปรงครงลาสดเมอวนท 01/07/2020
    1. การยอมรบขอตกลงในเงอนไขการใชงาน
    การสรางบญช MaJoy ไมวาจะผานอปกรณมอถอ แอปพลเคชนมอถอ หรอคอมพวเตอร (รวมเรยกวา
    "บรการ") หมายถง คณยนยอมเขาผกพนตาม (1) ขอตกลงการใชงานน (2) นโยบายความเปนสวนตว
    นโยบายการใชคกก (หากเกยวของกบคณ) และเคลดลบดานความปลอดภยของเรา ซงแตละสวนไดถกรวบ
    รวมไวเพอการอางองกบขอตกลงฉบบน และ (3) ขอกหนดใดๆ ทคณเปดเผยและยนยอม หากคณซอฟเจอร
    ผลตภณฑ หรอบรการเพมเตมทเรานเสนอในบรการ (รวมเรยกวา "ขอตกลง") หากคณไมยอมรบและไม
    ตกลงทจะเขาผกพนตามขอกหนดของขอตกลงน โปรดอยาใชบรการน
    เราอาจจะทการเปลยนแปลงขอมลในขอตกลงนและในบรการเปนครงคราว เราอาจจะดเนนการดงกลาว
    ดวยเหตผลทหลากหลาย รวมถงการทใหสอดคลองกบการเปลยนแปลงหรอขอกหนดทมในกฎหมาย
    คณลกษณะใหม ๆ หรอการเปลยนแปลงในแนวปฏบตทางธรกจ ขอตกลงเวอรชนลาสดจะไดรบการประ
    กาศไวบนบรการ ภายใตหวขอการตงคา และยงมอยท MaJoy.co และคณควรตรวจสอบเวอรชนทเปน
    ปจจบนทสดอยเสมอ เวอรชนลาสดคอเวอรชนทจะมผลบงคบใช ถาหากการเปลยนแปลงรวมถงการเปลยน
    แปลงเนอหาในสาระสคญทจะสงผลกระทบตอสทธหรอพนธะผกพนของคณ เราจะแจงใหคณทราบลวงหนา
    ถงการเปลยนแปลงดวยวธการทเหมาะสม รวมถงการแจงเตอนผานบรการหรอทางอเมล หากคณยงใชบร
    การตอไปหลงจากการเปลยนแปลงมผล นนหมายถงคณยอมรบในขอตกลงทมการแกไขปรบปรง
    2. การมคณสมบตตามเกณฑ
    คณตองมอายอยางนอย 18 ปบรบรณในการสรางบญชกบ MaJoy และใชบรการ โดยการสรางบญชและใช
    บรการนน หมายถงคณไดใหครบรองและรบประกนวา:
    • คณสามารถสรางสญญาผกพนกบ MaJoy ได
    • คณไมใชบคคลทถกสงหามไมใหใชบรการภายใตกฎหมายของสหรฐอเมรกา หรอภายใตเขต
    อนาจทางกฎหมายอนใดทม – ซงหมายความวาคณไมไดมชออยบนบญชรายชอประเทศทถก
    จบตามองเปนพเศษ (Specially Designated Nationals) ของกระทรวงการคลงแหงสหรฐอเมรกา
    หรอถกตองหามในลกษณะทคลายคลงกนอนใด
    • คณจะปฏบตตามขอตกลงน และกฎหมาย ระเบยบและขอบงคบทงของทองถน รฐ ประเทศ และระ
    หวางประเทศทงหมดทมบงคบใช และ
    • คณไมเคยถกพพากษาถงความผดอาญาอกฉกรรจ (หรออาชญากรรมทมความรนแรงคลายคลงกน)
    อาชญากรรมทางเพศ หรออาชญากรรมทเกยวกบความรนแรง และไมอยในบญชผกระทผดทาง
    เพศในรฐ รฐบาลกลาง หรอบญชทะเบยนผกระทผดทางเพศในทองถนใด ๆ
    3. บญชของคณ
    ในการใชงาน MaJoy คณอาจจะตองลงชอเขาใชโดยใชขอมลการเขาสระบบ เบอรมอถอของคณ หากคณ
    ดเนนการเชนนน จะหมายความวาคณอนญาตใหเราเขาถงและใชขอมลบางสวนจากบญช เบอรมอถอของ
    คณ สหรบรายละเอยดเพมเตมเกยวกบขอมลทเราเกบรวบรวมจากคณและวธการทเราใชขอมล กรณา
    ศกษาไดจากนโยบายความเปนสวนตวของเรา
    การรกษาความลบของขอมลการลอกอนทคณใชเพอสมครเขาสระบบของ MaJoy ถอเปนความรบผดชอบ
    ของคณ และคณเปนผรบผดชอบสหรบกจกรรมทงหมดทเกดขนภายใตขอมลประจตวเหลานนแตเพยงผ
    เดยว หากคณสงสยวามคนเขาถงบญชของคณ โปรด ตดตอเรา ทนท
    4. การแกไขเปลยนแปลงบรการและการยกเลกการใชงาน

    MaJoy มงมนเสมอทจะพฒนาปรบปรงบรการ และนเสนอการใชงานเพมเตมทคณจะไดมสวนรวมมากขน
    และมประโยชน นนหมายความวา เราอาจจะเพมคณลกษณะหรอการปรบปรงใหม ๆ ในผลตภณฑเปนครง
    คราว เชนเดยวกบการลบคณลกษณะบางอยาง และหากการดเนนนนไมไดมผลสคญตอสทธหรอพนธะผก
    พนของคณ เราอาจจะไมไดแจงใหคณทราบกอนดเนนการแกไขเปลยนแปลง เราอาจจะระงบบรการทงหมด
    ได ซงในกรณน เราจะแจงใหคณทราบลวงหนา เวนแตจะอยภายใตเหตขดของ เชน ปญหาดานความปลอด
    ภยหรอการรกษาความปลอดภย ทจะยบยงไมใหเราแจงใหคณทราบ
    คณอาจยกเลกบญชไดทกเวลาและไมวาดวยเหตผลใดกตามดวยการปฏบตตามคแนะนทระบใน "การตง
    คา" ในบรการน อยางไรกตาม หากคณใชบญชการชระเงนผานบคคลทสาม คณจะตองจดการการซอ
    ภายในแอปผานบญชดงกลาว (เชน iTunes, Google Play) เพอหลกเลยงการเรยกเกบเงนเพมเตม MaJoy
    อาจยกเลกบญชของคณเมอใดกไดโดยไมตองแจงใหทราบลวงหนา หากเราเชอวาคณไดละเมดขอตกลง
    ฉบบน เมอมการยกเลกการใชงาน คณจะไมมสทธไดรบเงนจากการซอภายในแอปคน หลงจากบญชถก
    ยกเลกแลว ใหถอวาขอตกลงนเปนอนสนสดเชนกน ยกเวนขอกหนดทจะยงคงมผลบงคบใชระหวางคณและ
    MaJoy ตอไปน ขอ 4, 5 และขอ 12 ถงขอ 19
    5. ความปลอดภยวาดวยการมปฏสมพนธกบสมาชกทานอน
    แม MaJoy จะมงมนสงเสรมใหเกดประสบการณของสมาชกทมความเคารพซงกนและกนผานฟเจอรตาง ๆ
    เชน การเลอกเขารวมของทงสองฝายซงจะใหสมาชกสอสารกนไดเฉพาะหลงจากททงสองฝายตางสนใจใน
    กนและกนเทานน แตทางเรา จะไมรบผดชอบตอพฤตกรรมของสมาชก ทงภายในและภายนอกบรการน
    คณตกลงทจะใชความระมดระวงในการมปฏสมพนธกบสมาชกทานอน โดยเฉพาะอยางยงหากคณตดสน
    ใจจะตดตอสอสารนอกบรการน หรอนดพบปะเปนการสวนตว นอกจากน คณตกลงทจะศกษาและปฏบตตาม
    เคลดลบดานความปลอดภยของ MaJoy กอนใชบรการน คณตกลงทจะไมมอบขอมลทางการเงน (เชน
    ขอมลบตรเครดต หรอบญชธนาคาร) หรอโอนเงน หรอสงเงนดวยวธการอนใดแกสมาชกทานอน
    คณจะรบผดชอบตอการมปฏสมพนธกบสมาชกทานอนแตเพยงผเดยว คณเขาใจดวา MaJoy ไมได ดเนน
    การตรวจสอบประวตอาชญากรรมของสมาชก และไมไดทการตรวจสอบภมหลงของสมาชก MaJoy ไมรบ
    รองหรอรบประกนพฤตกรรมของสมาชก
    6. สทธท MaJoy มอบใหคณ
    MaJoy อนญาตใหคณเขาถงและใชบรการไดเปนการสวนตว ทวโลก ไมตองมการกหนดมอบหมาย ไมเปน
    เอกสทธพเศษ เพกถอนได และไมสามารถนไปอนญาตชวงได การอนญาตนจะเปนไปตามวตถประสงคขอ
    งการใหคณใชและเพลดเพลนกบประโยชนจากบรการเทานน ตามเจตนาของ MaJoy และตามทขอตกลง
    ฉบบนอนญาตไว ดงนน คณยนยอมวาจะไม:
    • ใชบรการหรอเนอหาใด ๆ ทมอยในบรการ เพอวตถประสงคทางการคาใด ๆ โดยไมไดความ
    ยนยอมเปนลายลกษณอกษรจากเรา
    • คดลอก แกไข สงตอ สรางผลงานเลยนแบบ ใชประโยชน หรอผลตซซงเนอหา รปภาพ
    เครองหมายการคา ชอการคา เครองหมายบรการ หรอทรพยสนทางปญญา เนอหา หรอขอมลกร
    รมสทธอนใดทมลขสทธ และเขาถงไดผานบรการ ไมวาในทางใด ๆ โดยไมไดรบความยนยอมเปน
    ลายลกษณอกษรลวงหนาจาก MaJoy
    • แสดงออกโดยชดแจงหรอแสดงเปนนยวาขอความทคณสรางขนนนไดรบการรบรองโดย MaJoy
    • ใชโรบอต บอต สไปเดอร ครอวเลอร สเครปเปอร แอปพลเคชนคนหาเวบไซต/เรยกดขอมล พรอกซ
    หรออปกรณทดเนนการดวยตวเองหรออตโนมตอน ๆ วธการหรอกระบวนการใด ๆ เพอเขาถง
    เรยกด ทดชน "การทเหมองขอมล" หรอในวธการใด ๆ กตามทเปนการผลตซหรอหลบเลยง
    โครงสรางการนทางหรอการนเสนอของบรการ หรอเนอหาของบรการ

    • ใชบรการในวธทอาจจะแทรกแทรง ขดขวาง หรอสงผลกระทบในเชงลบตอบรการ หรอเซรฟเวอร
    หรอเครอขายทเชอมตอกบบรการ
    • อปโหลดไวรสหรอรหสทเปนอนตรายอน ๆ หรอทอนตรายตอการรกษาความปลอดภยของบรการ
    • ปลอมแปลงหวเรองหรอปรบเปลยนตวระบตวตน เพอจะอพรางตนตอขอมลใด ๆ ทสงไปยงหรอ
    ผานบรการ
    • "เฟรม" หรอ "มรเรอร" สวนหนงสวนใดของบรการโดยไมไดรบการอนญาตเปนลายลกษณอกษรลวง
    หนาจาก MaJoy
    • ใชเมกาแทกหรอรหส หรออปกรณอน ๆ ทมการอางองใด ๆ ถง MaJoy หรอบรการ (หรอ
    เครองหมายการคา ชอการคา เครองหมายบรการ โลโก หรอสโลแกนของ MaJoy) เพอสงบคคล
    ใด ๆ ไปยงเวบไซตใด ๆ เพอวตถประสงคใด ๆ กตาม
    • แกไข ดดแปลง มอบอนญาตชวง แปล ขาย ใชวศวกรรมยอนกลบ ถอดรหส แปลกลบ หรอแยกสวน
    ใด ๆ ของบรการ หรอเปนเหตใหผอนกระทการดงกลาว
    • ใชหรอพฒนาแอปพลเคชนของบคคลทสามใด ๆ ทจะตดตอโตตอบกบบรการ หรอเนอหาหรอขอมล
    ของสมาชกทานอน ๆ โดยไมไดรบความยนยอมเปนลายลกษณอกษรลวงหนาจากเรา
    • ใช เขาถง หรอเผยแพรสวนตดตอการเขยนโปรแกรมของแอปพลเคชน MaJoy โดยไมไดรบความ
    ยนยอมเปนลายลกษณอกษรจากเรา
    • ตรวจสอบ สแกน หรอทดสอบความเปราะบางของบรการของเรา หรอระบบ หรอเครอขายใด ๆ
    • สงเสรมหรอสนบสนนกจกรรมใด ๆ ทฝาฝนขอตกลงฉบบน
    เราอาจสบสวนและดเนนคดทางกฎหมายตามทมใด ๆ ตอการใชบรการโดยไมชอบดวยกฎหมาย และ/
    หรอ ไมไดรบอนญาต รวมถงการยกเลกบญชของคณ
    ซอฟตแวรใด ๆ ทเราจดหาไวใหคณ อาจจะดาวนโหลดและตดตงการอปเกรด อปเดต หรอคณลกษณะใหม
    ๆ เองโดยอตโนมต คณอาจจะแกไขการดาวนโหลดอตโนมตเหลานไดผานการตงคาในอปกรณของคณ
    7. สทธทคณมอบแก MaJoy
    ดวยการสรางบญช คณอนญาตให MaJoy มสทธในการถายโอน อนญาตชวง สมปทาน มสทธและออก
    ใบอนญาตเพอโฮสต จดเกบ ใชงาน ทสเนา แสดง ทซ เปลยนแปลง แกไข เผยแพร ดดแปลง และแจก
    จายขอมลทคณอนญาต (รวมเรยกวา "โพสต") ในบรการ หรอสงตอใหกบสมาชกทานอน ๆ (รวมเรยกวา
    "เนอหา") ได ใบอนญาตของ MaJoy สหรบเนอหาของคณนนเปนแบบไมผกขาด นอกเสยจาก ใบอนญาต
    ของ MaJoy นนจะมสทธเฉพาะสหรบงานทถกสรางขนโดยการใชบรการ ตวอยางเชน MaJoy จะมใบอน
    ญาตเฉพาะสหรบการจบภาพหนาจอของบรการทมเนอหาของคณอย นอกจากน เพอให MaJoy สามารถ
    ปองกนการใชเนอหาของคณนอกบรการได คณไดอนญาตให MaJoy สามารถดเนนการในนามของคณ
    เกยวกบการละเมดการใชงานเนอหาของคณจากบรการโดยสมาชกทานอนหรอบคคลทสามได โดยเจตนาน
    ครอบคลมถงอนาจ แตไมไดเปนขอผกมด ในการสงหนงสอแจงตามขอกหนด 17 U.S.C. § 512(c)(3)
    (กลาวคอ หนงสอแจงการเพกถอน DMCA) ในนามของคณ หากเนอหาของคณถกนมาใช และเปนการใช
    โดยบคคลทสามนอกบรการ การอนญาตของเราในการใชเนอหาของคณถอเปนสทธของคณ ภายใตกฎ
    หมายทบงคบใช (ตวอยางเชน กฎหมายทเกยวกบการปกปองขอมลสวนบคคลตามขอบเขตเนอหาใด ๆ ท
    มขอมลสวนบคคลตามทกหนดไวในกฎหมายเหลานน) และเพอวตถประสงคเฉพาะในการดเนนงาน กา
    รสราง การจดหา และการปรบปรงการบรการ และการวจยและพฒนาใหม ๆ คณยอมรบวา สมาชกทานอน
    ๆ และบคคลอนสามารถเขาชมหรอเขารวมในบรการ เนอหาใด ๆ ทคณวาง หรอทคณใหสทธแกเราในการ
    ใหบรการ (เชน บคคลอนทอาจไดรบเนอหาทแชรมาจากสมาชก MaJoy คนอน ๆ)

    คณรบรองวาขอมลทงหมดทคณนสงตอนสรางบญชของคณ รวมถงขอมลทนสงจากบญช Facebook
    ของคณ มความถกตองและเปนจรง และคณมสทธในการโพสตเนอหาบนบรการ และมอบการอนญาตใหแก
    MaJoy ตามขางตน
    คณเขาใจและยอมรบวา เราอาจตดตามหรอตรวจสอบเนอหาใด ๆ ทคณโพสต ในฐานะทเปนสวนหนงของ
    บรการ เราอาจจะลบเนอหาใด ๆ ไมวาจะทงหมดหรอบางสวน ตามทดลยพนจของเราแตเพยงผเดยว
    พจารณาแลววา เปนการฝาฝนขอตกลงฉบบน หรออาจจะเปนอนตรายตอชอเสยงของบรการ
    เมอตองสอสารกบตวแทนฝายดแลลกคาของเรา คณตกลงทจะใหความเคารพและแสดงออกอยางนมนวล
    หากเรารสกวาพฤตกรรมของคณ ทมตอตวแทนฝายดแลลกคาคนใดของเราหรอพนกงานของเรา เปนการ
    คกคามหรอกาวราว ไมวาในเวลาไหนกตาม เราขอสงวนสทธในยกเลกบญชของคณโดยทนท
    เพอเปนการตอบแทนท MaJoy อนญาตใหคณใชบรการ คณยนยอมใหเรา เราในเครอของเรา และ
    พนธมตรบคคลทสามของเรา อาจแสดงโฆษณาในบรการ โดยการสงคแนะนหรอความคดเหนใหแก
    MaJoy เกยวกบบรการของเรา จะหมายความวาคณยนยอมวา MaJoy อาจจะใชและแบงปนความคดเหน
    ดงกลาว เพอวตถประสงคใด ๆ โดยไมจายคาตอบแทนใหคณ
    โปรดทราบวา ในการทขอตกลงนกบคณ MaJoy อาจเขาถง จดเกบ และเปดเผยขอมลบญชและเนอหาของ
    คณตามทกฎหมายกหนด หรอกระทดวยความเชอโดยสจรตวา การเขาถง จดเกบ หรอเปดเผยดงกลาว
    ชอบดวยกฎหมาย เชน (1) การปฏบตตามกระบวนการทางกฎหมาย (2) การบงคบใชตามขอตกลงฉบบน
    (3) การกระทตามขอรองเรยนวามเนอหาทละเมดสทธของบคคลทสาม (4) การกระทตามครองขอของ
    คณวาดวยการบรการลกคา หรอ (5) การปกปองสทธ ทรพยสน หรอความปลอดภยสวนบคคลของเรา หรอ
    บคคลอน
    8. กฎเกณฑของชมชน
    โดยการใชบรการน หมายความวาคณยนยอมทจะไม:
    • ใชบรการเพอวตถประสงคใด ๆ ทไมชอบดวยกฎหมายหรอเปนสงตองหามตามขอตกลงฉบบน
    • ใชบรการเพอวตถประสงคทเปนอนตรายหรอชวรายใด ๆ
    • ใชบรการเพอทลาย MaJoy
    • ละเมด หลกเกณฑของชมชน ของเรา ซงไดรบการปรบปรงเปนครงคราว
    • สรางสแปม เรยกรองเงนจากผใช หรอลอลวงสมาชกทานอน
    • ปลอมเปนบคคลหรอนตบคคลใด ๆ หรอโพสตรปภาพใด ๆ ของบคคลอนโดยไมไดรบอนญาตจาก
    เขาหรอเธอ
    • กลนแกลง "ไลตาม" ขมข ทรายรางกาย คกคาม ทารณ หรอหมนประมาทบคคลใด ๆ
    • โพสตเนอหาใด ๆ ทฝาฝนหรอละเมดสทธของผใดผหนง รวมถงสทธของการเผยแพรประชาสมพนธ
    ความเปนสวนตว ลขสทธ เครองหมายการคา หรอทรพยสนทางปญญาหรอสทธในทางสญญาอน ๆ
    • โพสตเนอหาใด ๆ ทเปนประทษวาจา เปนการคกคาม สออยางชดเจนถงเรองเพศ หรอเปนเรอง
    ลามกอนาจาร ยยงปลกปนใหเกดความรนแรง หรอมการเปลอยกายหรอเปนความรนแรงทางภาพ
    หรอความรนแรงทไมมความจเปน
    • การโพสตเนอหาใด ๆ ทสงเสรมการเหยยดผว ลทธ ความเกลยดชง หรอความเสยหายทาง
    กายภาพใด ๆ กบกลมหรอบคคลใด ๆ
    • เรยกรองขอรหสผานเพอวตถประสงคใด ๆ หรอขอขอมลระบตวตนเพอวตถประสงคในเชงพาณชย
    หรอวตถประสงคทไมชอบดวยกฎหมายจากสมาชกทานอน ๆ หรอเผยแพรขอมลสวนบคคลขอ
    งบคคลอน โดยไมไดรบอนญาตจากเขาหรอเธอ
    • ใชบญชของสมาชกทานอน ใชบญชรวมกบสมาชกทานอน หรอมมากกวาหนงบญช

    • สรางบญชอนขนมา หากเราไดยกเลกบญชของคณไปแลว เวนแตจะไดรบอนญาตจากเรา
    MaJoy ขอสงวนสทธในการสบสวนและ/หรอยกเลกบญชของคณ โดยไมมการคนเงนสหรบการซอใน
    แอปใด ๆ หากคณไดละเมดขอตกลงน ใชบรการในทางทผด หรอประพฤตในทางท MaJoy เหนวาไมเห
    มาะสมหรอผดกฎหมาย รวมถงการกระทการหรอการสอสารทเกดขนในหรอนอกบรการ
    9. เนอหาของสมาชกทานอน
    แมวา MaJoy จะสงวนสทธในการตรวจสอบและลบเนอหาทละเมดขอตกลงฉบบน เนอหาดงกลาวเปนความ
    รบผดชอบของสมาชกททการโพสตแตเพยงผเดยว และ MaJoy ไมสามารถรบประกนไดวาเนอหาทงหมด
    จะเปนไปตามขอตกลงน หากคณเหนเนอหาทละเมดขอตกลงน โปรดรายงานภายในบรการหรอผาน แบบ
    ฟอรมการตดตอของเรา
    10. การซอ
    โดยทวไป MaJoy อาจนเสนอผลตภณฑและบรการสหรบการซอเปนครงคราว ("การซอภายในแอป")
    ผาน iTunes, Google Play หรอการเรยกเกบเงนผานผใหบรการ การเรยกเกบเงนโดยตรงจาก MaJoy
    หรอแพลตฟอรมการชระเงนอน ๆ ทไดรบอนญาตจาก MaJoy หากคณเลอกทจะทการซอภายในแอป
    คณจะไดรบแจงใหยนยนการซอของคณกบผใหบรการชระเงนทเกยวของ และวธการชระเงนของคณ (ไม
    วาจะเปนบตรของคณ หรอบญชของบคคลทสามเชน Google Play หรอ iTunes) (เรยกวา "วธการชระเงน"
    ของคณ) จะถกเรยกเกบเงนสหรบการซอภายในแอปตามราคาสหรบบรการทคณเลอก รวมถงภาษการ
    ขายหรอภาษอน ๆ ทคลายกนทอาจมการเรยกเกบรวมอยในการชระเงนของคณ และคณอนญาตให
    MaJoy หรอบคคลทสามเรยกเกบเงนจากคณได หากคณซอบรการสมาชกทมการเรยกเกบเงนโดยอตโน
    มตตามชวงเวลาทกหนดผานการซอภายในแอป วธการชระเงนของคณจะถกเรยกเกบเงนคาสมาชกไป
    เรอยๆ จนกวาจะทการยกเลก หลงพนระยะผกพนของการสมครสมาชกเรมแรก และอกครงหลงจากชวง
    เวลาการตออายสมาชก ระบบจะตออายสมาชกใหคณโดยอตโนมตตามระยะอายสมาชกเดม ในราคาทคณ
    ตกลงไวขณะสมครสมาชก
    การตออายอตโนมตและการชระบตรอตโนมต
    ระบบจะตออายสมาชกโดยอตโนมตจนกวาคณจะยตหรอยกเลกสมาชก เมอคณสมครสมาชก วธการชระ
    เงนของคณจะถกเรยกเกบเงนรายเดอนลวงหนาภายใน 24 ชวโมงนบจากวนทซอครงแรกในราคาทคณ
    ตกลงไวขณะสมครสมาชก ขอมลการชระเงนดวยบตรจะถกจดเกบและใชสหรบการชระเงนอตโนมตผา
    นบตรตามขอตกลงน
    หากตองการคดคานการชระเงนทไดชระไปแลว โปรดสงครองไปทฝายสนบสนนลกคา ในกรณทคณถก
    เรยกเกบเงนโดยตรงจาก MaJoy หรอบญชบคคลทสามทเกยวของ เชน iTunes นอกจากน คณยงทการ
    คดคานไดโดยตดตอไปยงธนาคารหรอผใหบรการการชระเงนซงสามารถใหขอมลเพมเตมเกยวกบสทธ
    ของคณ รวมถงขอจกดทางดานเวลาดวย
    คณอาจเพกถอนความยนยอมใหชระเงนผานบตรอตโนมตไดทกเมอโดยไมมเงอนไขใด ๆ โดยไปทการตง
    คาใน MaJoy หรอบญชบคคลทสามทเกยวของ แตโปรดทราบวา คณยงตองชระยอดคงคางทเหลออย
    หากตองการเปลยนแปลงหรอยกเลกสมาชก คณจะตองลอกอนเขาในบญชบคคลทสามของคณ (หรอ "การ
    ตงคา" ใน MaJoy) และปฏบตตามวธการยตหรอยกเลกสมาชก แมจะลบบญชทมกบเรา หรอลบ
    แอปพลเคชน MaJoy จากอปกรณของคณแลวกตาม การลบบญชของคณใน MaJoy หรอการลบแอปพล
    เคชน MaJoy จากอปกรณของคณ ไมถอเปนการยตหรอยกเลกสมาชกของคณ MaJoy จะยงคงเรยกเกบเงน
    ทงหมดตามวธการชระเงนของคณ จนกวาคณจะยตหรอยกเลกสมาชกใน MaJoy หรอผานบญชบคคลท
    สาม แลวแตกรณ หากยตหรอยกเลกสมาชก คณอาจยงใชบรการสมาชกไดจนกวาจะสนสดอายสมาชกปจ
    จบน และระบบจะไมตออายสมาชกหลงอายสมาชกครงปจจบนสนสดลง

    อาจมการบงคบใชขอกหนดเพมเตม หากคณชระกบ MaJoy โดยตรงตามวธการชระเงนของคณ หาก
    คณชระเงนกบ MaJoy โดยตรง MaJoy อาจแกไขขอผดพลาดเรองการเรยกเกบเงนหรอขอผดพลาดอน ๆ
    ทปรากฏไดแมวาจะไดเรยกเกบหรอไดรบการชระเงนนนไปแลวกตาม หากคณเรมดเนนการปฏเสธการ
    ชระเงนหรอขอเรยกการชระเงนคนดวยวธการชระเงนของคณ MaJoy อาจยกเลกบญชของคณไดทนท
    ตามดลยพนจของเรา แตเพยงผเดยว
    คณอาจแกไขขอมลวธการชระเงนไดโดยเขา MaJoy และไปทการตงคา หากการชระเงนนนยงไมเสรจสน
    เนองจากบตรหมดอาย วงเงนไมเพยงพอ หรอดวยเหตอนใด และคณไมไดทการแกไขขอมลวธการชระเงน
    ยตหรอยกเลกสมาชก ใหถอวาคณยงคงตองรบผดชอบตอยอดเงนทยงไมไดเรยกเกบ และอนญาตใหเรา
    ดเนนการเรยกเกบเงนตามวธการชระเงนตอไป เนองจากอาจมการอปเดตขอมลดงกลาว ซงอาจสงผลให
    มการเปลยนแปลงวนทในเรยกเกบเงนได นอกจากน คณอนญาตใหเรา ขอวนหมดอายใหม หรอวนหมด
    อายและหมายเลขบตรเครดตหรอเดบตใบใหมทออกใหโดยผออกบตรเครดตหรอบตรเดบตของคณ
    เงอนไขในการชระเงนของคณจะขนอยกบวธการชระเงน และอาจถกกหนดโดยขอตกลงระหวางคณและ
    สถาบนการเงน ผออกบตรเครดต หรอผใหบรการอน ตามวธการชระเงนทคณกหนด หากคณพนกนอก
    ทวปอเมรกา คณยนยอมใหดเนนการชระเงนให MaJoy
    Super Likes หรอไอเทมเสมอนจรงอน ๆ บางครงคณอาจซอสทธการใชงานแบบจกด สวนบคคล ไมสา
    มารถถายโอนได ไมสามารถโอนชวงสทธได แตเพกถอนได เพอใช "ไอเทมเสมอน" ซงรวมถงแตไมจกด
    เพยง Super Likes (รวมเรยกวา "ไอเทมเสมอน") ยอดไอเทมเสมอนคงเหลอทปรากฏในบญชของคณไมถอ
    เปนยอดคงเหลอในโลกจรง และไมไดสะทอนถงมลคาทเกบไว แตถอเปนหนวยวดขอบเขตของสทธการใช
    งานของคณ ไอเทมเสมอนไมมการเรยกเกบคาธรรมเนยมหากไมมการใชงาน อยางไรกตาม สทธการใชงา
    นทมอบใหคณในไอเทมเสมอนนนจะยตลงตามเงอนไขทระบในขอตกลงน เมอ MaJoy ยตการใหบรการน
    หรอในกรณทบญชของคณถกปดหรอยกเลก MaJoy ขอใชดลยพนจแตเพยงฝายเดยวในการสงวนสทธการ
    เรยกเกบคาธรรมเนยมสหรบสทธในการเขาถงหรอใชไอเทมเสมอน และ/หรออาจแจกจายไอเทมเสมอน
    โดยเรยกหรอไมเรยกเกบคาใชจาย MaJoy อาจจดการ กกบ ควบคม เปลยนแปลง หรอยกเลกไอเทมเส
    มอนเมอใดกได และจะไมรบผดชอบตอคณหรอบคคลทสามในกรณท MaJoy ใชสทธดงกลาว ไอเทมเสมอ
    นใชไดผานบรการนเทานน การซอและการแลกใชไอเทมเสมอนทงหมดทกระทผานบรการนถอเปนทสนสด
    และไมสามารถขอเงนคนได ขอกหนดของไอเทมเสมอนสหรบใชในบรการน คอบรการทเรมมผลทนทท
    มการยอมรบการซอไอเทมเสมอนดงกลาว คณรบทราบวา MaJoy ไมจเปนตองคนเงนในสวนทเกยวกบไอ
    เทมเสมอนไมวาดวยเหตผลใด และคณจะไมไดรบเงนหรอคาชดเชยอนสหรบไอเทมเสมอนทไมไดใชเมอ
    ปดบญช ไมวาบญชดงกลาวจะถกปดดวยความสมครใจหรอไมกตาม
    การคนเงน โดยทวไปแลว คณจะขอเงนคนสหรบคาใชจายในการซอทงหมดไมได และจะไมมการคนเงน
    หรอเครดตคนใหสหรบชวงเวลาทใชไปบางสวน เราอาจจะยกเวนให หากการคนเงนสหรบการบอกรบ
    เปนสมาชกแบบอน ๆ นนมการรองขอเขามาภายในสบสวนภายหลงจากวนทมการทธรกรรม หรอหา
    กกฎหมายในเขตอนาจศาลของคณกหนดใหตองคนเงน
    การซอไอเทมเสมอนจรงจะถอเปนอนสนสดและคนเงนไมได
    ในการรองขอเงนคน:
    Iหากคณสมครใชงานโดยใช Apple ID ของคณ Apple จะเปนผจดการเรองเงนคนของคณ มใช MaJoy
    ในการรองขอเงนคน ใหไปท iTunes คลกท Apple ID ของคณ จากนนเลอก "ประวตการซอ" คนหารา
    ยการและเลอก "รายงานปญหา" นอกจากน คณยงสามารถสงครองไปท https://getsupport.apple.com
    ในกรณทคณสมครสมาชกโดยใชบญช Google Play Store หรอผาน MaJoy โดยตรง โปรดตดตอฝาย
    ดแลลกคา พรอมดวยหมายเลขคสงซอของคณสหรบ Google Play Store (หมายเลขคสงซอนอยใน

    อเมลยนยนการสงซอหรอโดยการลอกอนเขาสระบบ Google Wallet) หรอ MaJoy (ขอมลนอยในอเมล
    ยนยนการสงซอ)
    คณไมสามารถยกเลกคสงซอสหรบการสงมอบเนอหาดจทลทไมไดสงมอบบนสอบนทกทางกายภาพได
    หากวากระบวนการคสงไดเรมขนแลวดวยความยนยอมและการรบทราบของคณลวงหนาอยางชดแจงของ
    คณวา คณจะเสยสทธในการยกเลก ขอกหนดนใชบงคบกบการซอไอเทมเสมอนดวย ซงหมายความวาการ
    ซอดงกลาวเปนทสนสดและไมสามารถคนเงนได
    การกหนดราคา MaJoy ดเนนธรกจระดบโลกและใหบรการแกชมชนทมความหลากหลายของสมาชก
    โครงสรางการกหนดราคาของเราอาจแตกตางกนไปตามภมภาค ระยะเวลาในการสมครสมาชก ขอเส
    นอรวมหลายบรการ โปรโมชนในแอปลาสด และปจจยอน ๆ เราทดสอบคณสมบตใหม ๆ และการกหนด
    ราคาตาง ๆ เพอใหสมาชกมการใชงานทหลากหลายและมตวเลอกการชระเงนทมากขน หากพวกเขาเลอก
    ทจะใชงาน
    11. หนงสอแจงและวธการดเนนการยนครองเรองการละเมดลขสทธ
    หากคณเชอวาผลงานของคณถกคดลอกและโพสตไวบนบรการ ในวธการทกอใหเกดการละเมดลขสทธ
    กรณาสงขอมลดงตอไปนไปใหตวแทนฝายดแลลขสทธ (Copyright Agent) ของเรา:
    • ลายมอชอแบบอเลกทรอนกสหรอลายมอชอทเขยนดวยปากกาของบคคลทไดรบอนญาตใหกระท
    การในนามของผถอผลประโยชนในลขสทธ
    • คอธบายของงานลขสทธทคณอางวาถกละเมด
    • คอธบายวาเนอหาทคณอางวามการละเมดนนอยสวนใดในบรการ (และคอธบายดงกลาวจะตอ
    งมความเพยงพออยางสมเหตสมผล เพอชวยใหเราคนหาเนอหาทถกกลาวหาวาละเมดได)
    • ขอมลตดตอของคณ รวมถงทอย หมายเลขโทรศพท และอเมล
    • หนงสอแถลงความจากคณทระบวาคณมความเชอโดยสจรตใจวา การใชงานทขดแยงนน ไมไดรบ
    อนญาตจากเจาของลขสทธ ตวแทนของเจาของ หรอกฎหมาย และ
    • คแถลงของคณ ททขนภายใตบทลงโทษการใหการเทจ วาขอมลขางตนในใบแจงของคณนนถก
    ตองทกประการ และคณเปนเจาของลขสทธหรอผไดรบอนญาตใหกระทการแทนเจาของลขสทธ
    12. การปฏเสธความรบผด
    MaJoy ใหบรการบนพนฐานของ "ลกษณะทเปน" และ "ตามทม" และตามขอบเขตทกฎหมายทมอนญาตไว
    เราจะไมใหการรบประกน ไมวาในรปแบบใด ๆ ไมวาจะเปนไปโดยชดแจง โดยนย โดยกฎหมาย ในสวนท
    เกยวของกบบรการ (รวมถงเนอหาทงหมดทมอยในบรการนน) รวมถงแตไมจกดเพยงแต การรบประกน
    โดยนยใด ๆ ถงคณภาพทพงพอใจ การแสวงหาประโยชนในเชงพาณชย ความเหมาะสมสหรบวตถประ
    สงคเฉพาะดาน หรอการไมละเมดสทธ MaJoy ไมรบรองหรอรบประกนวา (ก) บรการจะไมถกรบกวน ม
    ความมนคง หรอปราศจากขอผดพลาด (ข) จะมการแกไขขอบกพรองหรอขอผดพลาดใด ๆ ในบรการ หรอ
    (ค) เนอหาหรอขอมลใด ๆ ทคณไดรบผานบรการจะมความถกตอง
    MaJoy จะไมรบผดชอบตอเนอหาใด ๆ ทคณ หรอสมาชกทานอน หรอบคคลทสามโพสต สง หรอรบผานบ
    รการ ในการเขาถงเนอหาใด ๆ ทดาวนโหลดหรอไดรบมาผานการใชบรการ คณจะตองใชดลยพนจและอย
    บนความเสยงของคณเอง
    13. บรการของบคคลทสาม
    บรการอาจจะมเนอหาโฆษณาและการสงเสรมการขายทนเสนอโดยบคคลทสาม และมลงกไปยงเวบไซต
    หรอแหลงขอมลอน ๆ MaJoy ไมรบผดชอบตอความพรอมใหบรการ (หรอการขาดความพรอมในการให
    บรการ) ของเวบไซตหรอแหลงขอมลภายนอกดงกลาว หากคณเลอกทจะมปฏสมพนธกบบคคลทสามทม

    ผานบรการของเรา เงอนไขของฝายดงกลาวจะกกบควบคมความสมพนธทมกบคณ MaJoy ไมรบผดชอบ
    หรอรบผดตอเงอนไขหรอการกระทการของบคคลทสามดงกลาว
    14. ขอจกดความรบผด
    ภายใตขอบเขตสงสดทกฎหมายทมอนญาตไว ไมวาในกรณในกตาม MaJoy เราในเครอ พนกงาน ผออก
    ใบอนญาต หรอผใหบรการของเรา จะไมรบผดตอความเสยหายทเกดขนทางออม เปนผลสบเนอง เปนแบ
    บอยาง เกดขนโดยบงเอญ เปนการเฉพาะ หรอเพอลงโทษ รวมถงแตไมจกดเพยงแต การสญเสยผลกไร
    ไมวาจะเกดขนโดยตรงหรอโดยออม หรอการสญเสยขอมลใด ๆ การใชงาน คาความนยม หรอการสญเสยท
    จบตองไมไดอน ๆ อนเปนผลมาจาก: (1) การเขาถง หรอการใช หรอการไมสามารถเขาถง หรอไมสามา
    รถใชบรการโดยคณ (2) การกระทการหรอเนอหาของสมาชกทานอน ๆ หรอบคคลทสามเกยวกบ ผาน
    หรอทเปนผลสบเนองจากการใชบรการ หรอ (3) การเขาถง การใชงาน หรอการแกไขเนอหาของคณโดยไม
    ไดรบอนญาต หากแมวา MaJoy จะไดรบแจงถงโอกาสความเปนไปไดของความเสยหายดงกลาวแลวกตาม
    ไมวาในกรณใดกตาม ความรบผดโดยรวมของ MaJoy ทมตอคณสหรบขอเรยกรองทงหมดทเกยวขอ
    งกบบรการ จะตองไมมากเกนกวาจนวนเงนทคณจายใหแก MaJoy และ 100 เหรยญดอลลารสหรฐ สหรบ
    คาบรการในขณะทคณยงมบญชอย
    เขตอนาจทางกฎหมายบางแหงไมอนญาตใหละเวนหรอจกดความเสยหายบางประการ ดงนน ขอละเวน
    และขอจกดบางสวนหรอทงหมดในหวขอน อาจจะไมมผลใชกบคณ
    15. อนญาโตตลาการ การสละสทธแหงการฟองคดแบบกลม และการสละสทธไมขอรบพจารณาคดดวยคณะ
    ลกขน
    ยกเวนสหรบสมาชกทพนกอยภายในสหภาพยโรปหรอเขตเศรษฐกจยโรป และทอน ๆ ทกฎหมายทมได
    หามเอาไว:
    1. วธการเดยวในการระงบขอพพาทหรอขอเรยกรองทเกดขนจากหรอเกยวของกบขอตกลงฉบบน
    (รวมถงขอกลาวหาการละเมดฝาฝนใด ๆ ในขอตกลง) หรอบรการ จะตองดเนนการโดยวธการอ
    นญาโตตลาการ ซงไดรบการจดการโดย JAMS ภายใตกฎระเบยบและขนตอนการ
    อนญาโตตลาการทไดรบการปรบปรงแลว ยกเวนตามทไดรบการแกไขโดย กระบวนการอนญาโต
    ตลาการ ขอยกเวนเดยวของเอกสทธการอนญาโตตลาการคอ แตละฝายมสทธในการฟองรองแบบ
    รายบคคลตออกฝายหนงในศาลคดมโนสาเรของเขตอนาจศาลทมอนาจตดสนคด หรอตออน
    ญาโตตลาการ ฝายทตองดเนนการสามารถขอใหมการพจารณาขอพพาทในศาลคดมโนสาเรแทน
    หากวาขอพพาทนนอยในอนาจศาลของศาลคดมโนสาเร หากมการรองขอใหดเนนการในศาลคด
    มโนสาเรกอนทจะมการตงอนญาโตตลาการ อนญาโตตลาการจะถกยกเลกไป หากมการรองขอให
    ดเนนการในศาลคดมโนสาเรหลงจากทไดมการตงอนญาโตตลาการไปแลว อนญาโตตลาการ
    จะทการตดสนวาขอพพาทดงกลาวควรจะอยในกระบวนการอนญาโตตลาการ หรอจะถกตดสน
    ในศาลคดมโนสาเรแทน โดยคณสามารถขอใหมการอนญาโตตลาการดงกลาวไดโดยการสง
    ครองเปนลายลกษณอกษรเทานน เวนแตคณหรอ MaJoy เลอกทจะเรยกรองสทธในการสอบปาก
    เปลากอนทจะมการอนญาโตตลาการ แตไมวาคณจะเลอกใชการอนญาโตตลาการหรอการฟองรอง
    คดในศาลคดมโนสาเร คณยอมรบวา ไมวาจะเปนกรณใดๆ กตาม คณจะไมสามารถเรม ดเนนคด
    หรอเขารวมในลกษณะของการฟองคดตอเราในนามกลมบคคล การอนญาโตตลาการในนามกลม
    บคคล การฟองคดในนามกลมบคคล หรอการดเนนคดตอ MaJoy ได
    2. โดยการใชบรการในทกลกษณะ จะหมายความวาคณยอมรบในขอตกลงเรองการอนญาโตตลาการ
    ขางตนแลว ในการกระทการเชนนนหมายถง คณไดสละในสทธแหงการฟองรองในศาลคดมโน
    สาเร เพอยนยนหรอคดคานขอเรยกรองใด ๆ ระหวางคณและเรา (ยกเวนสหรบเหตทอาจสงฟอง

    ในศาลคดมโนสาเรได) และคณยงไดสละสทธการเขารวมการฟองคดในนามกลมบคคล หรอกา
    รดเนนคดในนามกลมบคคลอน ๆ หากคณเรยกรองสทธตอ MaJoy นอกศาลคดมโนสาเร (และ
    MaJoy ไมไดรองขอใหยายครองไปทศาลคดมโนสาเร) สทธของคณนนจะไดรบการพจารณาโด
    ยอนญาโตตลาการทเปนกลาง ไมใชผพพากษาหรอคณะลกขน และอนญาโตตลาการจะตดส
    นขอเรยกรองและขอพพาททงหมดทเกยวของกบอนญาโตตลาการ คณมสทธไดรบการไตสวนอยาง
    เปนธรรมกอนพบอนญาโตตลาการ อนญาโตตลาการสามารถสงการใหมการแกไขเยยวยาไดเชน
    เดยวกบศาล รวมถงความสามารถในการพจารณาครอง (ซงอาจรวมถงครองตามคแถลงของค
    กรณ และครองตามคแถลงของคกรณพรอมพยานหลกฐานทสงมา) แตคณควรทราบวา กระบวน
    การพจารณาตามการอนญาโตตลาการนน มกจะเรยบงายกวา และดเนนไปไดรวดเรวกวาการไต
    สวนและกระบวนการพจารณาเพอตดสนอน ๆ ของศาล คตดสนของอนญาโตตลาการจะมผลบงคบ
    ใชไดในศาล และอาจจะถกกลบคตดสนโดยศาลไดดวยเหตผลทจกดอยางมากเทานน สหรบ
    รายละเอยดเกยวกบกระบวนการอนญาโตตลาการ โปรดดท กระบวนการอนญาโตตลาการ
    3. กระบวนการพจารณาใด ๆ เพอบงคบใชขอตกลงอนญาโตตลาการน รวมถงกระบวนการพจารณา
    ใด ๆ เพอยนยน แกไข หรอยกเลกการมอบอนญาโตตลาการ อาจจะเรมตนไดในศาลใด ๆ กตาม
    ของเขตปกครองทางกฎหมายทมอนาจตดสนคดความ ในกรณทขอตกลงการอนญาโตตลาการม
    ขนเพอเหตผลใดกตาม ไดรบการพจารณาวาไมสามารถบงคบใชได การฟองรองใด ๆ ตอเรา
    (ยกเวนสหรบการดเนนคดในศาลคดมโนสาเร) อาจจะกระทไดเฉพาะในศาลรฐบาลกลางหรอ
    ศาลประจรฐทอยในเมองแดลลส รฐเทกซสเทานน ในการน คณใหความยนยอมโดยเพกถอนมได
    ตอเขตอนาจทางกฎหมายของศาลเหลานสหรบวตถประสงคดงกลาว
    4. คณสามารถใชแพลตฟอรมขอตกลงการปฏเสธทางออนไลนของ European Commission ทาง
    MaJoy ไมมสวนเกยวของกบขนตอนของการระงบขอพพาทโดยอนญาโตตลาการสหรบสมาชกท
    พนกอยในสหภาพยโรปหรอบรเวณเศรษฐกจยโรป
    16. กฎหมายทใชบงคบ
    สหรบสมาชกทพนกอยในสหภาพยโรปหรอเขตเศรษฐกจยโรป หรอประเทศอน ๆ ทกฎหมายหามใชขอ
    ตกลงการอนญาโตตลาการของเรา กฎหมายของรฐเทกซส ประเทศสหรฐอเมรกา โดยไมรวมถงหลกการ
    แหงความขดแยงของขอกฎหมายของรฐเทกซส จะมผลบงคบใชกบขอพพาทใด ๆ กตามทเกดขนหรอเกยว
    ของกบขอตกลงฉบบนหรอบรการ อยางไรกตาม แมจะมขอตกลงดงกลาวขางตน ขอตกลงอนญาโตตลาการ
    ในหวขอ 16 ขางตนจะอยภายใตบงคบแหงพระราชบญญตอนญาโตตลาการของรฐบาลกลาง (Federal
    Arbitration Act) เพอหลกเลยงขอสงสย ตวเลอกการใชกฎหมายควบคมของรฐเทกซสนน จะไมมอนาจ
    เหนอกวากฎหมายการคมครองผบรโภคทมบงคบใชในเขตอนาจทางกฎหมายดงกลาว
    17. สถานท
    นอกจากสมาชกทพนกอยในสหภาพยโรป หรอเขตเศรษฐกจยโรป ซงอาจนขอเรยกรองไปใชในประเทศท
    พนกไดตามกฎหมายทใชบงคบ และยกเวนการเรยกรองทอาจนไปสการฟองรองในศาลเลก ทอาจไดรบ
    คาเสยหายจากศาลขนาดเลก การเรยกรองทงหมดทเกดขนจาก หรอเกยวของกบขอตกลงฉบบน ตอบรการ
    หรอความสมพนธของคณกบ MaJoy วาดวยเหตผลใดกตาม จะไมถกสงไปยงอนญาโตตลาการ และจะถก
    ฟองรองเฉพาะในศาลของรฐบาลกลาง หรอดลลสเคานต รฐเทกซส สหรฐอเมรกาเทานน คณและ MaJoy
    ยนยอมใหมการใชเขตอนาจศาลสวนบคคลของศาลในรฐเทกซส และจะไมใชสทธเรยกรองใด ๆ วาศาล
    ดงกลาวเปนศาลทไมสะดวก
    18. การชระคาสนไหมทดแทนโดยคณ

    คณยนยอมวา ภายใตขอบเขตทกฎหมายทมอนญาตไว จะชดใช ปกปอง และไมฟองรอง MaJoy เราใน
    เครอของเรา และเจาหนาท ผบรหาร ตวแทน และพนกงานของพวกเขาและของเรา จากการรองเรยน การ
    เรยกรอง การฟองรอง ความเสยหาย การสญเสย ตนทน ความรบผด และคาใชจายใด ๆ และทงหมด รวม
    ถงคาธรรมเนยมทนายความ ทมเหตมาจาก เกดขนจาก หรอเกยวของในทางใดทางหนงกบ การเขาถงหรอ
    ใชบรการของคณ เนอหาของคณ หรอการฝาฝนขอตกลงนของคณ
    19. ขอตกลงเบดเสรจและอน ๆ
    ขอตกลงน พรอมดวย นโยบายความเปนสวนตว นโยบายการใชคกก คแนะนดานความปลอดภย
    กระบวนการอนญาโตตลาการ (หากเกยวของกบคณ) และเงอนไขใด ๆ ทคณไดรบแจงและยนยอมตกลง
    หากคณซอคณลกษณะ ผลตภณฑ หรอบรการทเรานเสนอไวบนบรการเพมเตม จะมขอตกลงเบดเสรจ
    ระหวางคณและ MaJoy เกยวกบการใชบรการอย หากขอกหนดใด ๆ ของขอตกลงฉบบนมอนตองเปน
    โมฆะ เนอหาสวนทเหลอของขอตกลง จะยงมผลบงคบใชอยางเตมทและสมบรณทกประการ การทเราไมสา
    มารถใชสทธหรอบงคบใชสทธหรอขอกหนดใด ๆ ในขอตกลงฉบบนได จะไมถอวาเปนการสละซงสทธหรอ
    ขอกหนดดงกลาว คณยนยอมวาบญช MaJoy ของคณจะโอนยายไมได และสทธทงหมดของคณในบญช
    รวมถงเนอหาในบญช จะสนสดลงเมอคณเสยชวต จะไมมเราตวแทน หางหนสวน กจการรวมคา ผไดรบมอบ
    หมายอนาจ หรอความสมพนธพเศษอน ๆ หรอการจางงานใด ๆ ทถกสรางขนอนเปนผลมาจากขอตกลง
ฉบบน และคณจะตองไมใหครบรองหรอผกพนในนามของ MaJoy ไมวาจะเปนในลกษณะใดกตาม</p>`

export default class ProvisionScreen extends React.Component {
    static navigationOptions = {

    };

    constructor(props) {
        super(props);
        this.state = {
            checked: false,
        }

    }

    componentWillMount() {
        BackHandler.addEventListener('hardwareBackPress', this.handleBackButtonClick);
    }

    componentWillUnmount() {
        BackHandler.removeEventListener('hardwareBackPress', this.handleBackButtonClick);
    }

    handleBackButtonClick = () => {
        return true;
    };


    render() {

        return (
            <View style={styles.container}>
                <ScrollView showsVerticalScrollIndicator={false} style={{ flex: 1 }}>
                    <View style={styles.inputWrapper2}>
                        <View style={{ alignItems: 'center', marginBottom: 10 }}>
                            <Images
                                width={width * .2}
                                source={require('../../../assets/images/logo_MAJOY.png')}
                            />
                        </View>
                        <Text style={styles.inputLabel3}>ขอต้อนรับสู่ Majoy</Text>
                        <Text style={styles.inputLabel2}>กรุณาปฏิบัติตามกฏกติกามารยาทของบ้านหลังนี้</Text>
                    </View>
                    <View style={{ marginTop: -20, padding: 10 }}>
                        <Text style={styles.inputLabel2}>ปรับปรุงครั้งล่าสุดเมื่อวันที่ 01/07/2020</Text>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>1. การยอมรับข้อตกลงในเงื่อนไขการใช้งาน</Text>
                            <Text style={[styles.inputLabel4]}>การสร้างบัญชี MaJoy ไม่ว่าจะผ่านอุปกรณ์มือถือ แอปพลิเคชันมือถือ หรือคอมพิวเตอร์ (รวมเรียกว่า "บริการ") หมายถึง คุณยินยอมเข้าผูกพันตาม {'\n'} (1) ข้อตกลงการใช้งานนี้ {'\n'} (2) นโยบายความเป็นส่วนตัว นโยบายการใช้คุ้กกี้ (หากเกี่ยวข้องกับคุณ) และเคล็ดลับด้านความปลอดภัยของเรา ซึ่งแต่ละส่วนได้ถูกรวบรวมไว้เพื่อการอ้างอิงกับข้อตกลงฉบับนี้ และ {'\n'} (3) ข้อกำหนดใดๆ ที่คุณเปิดเผยและยินยอม หากคุณซื้อฟีเจอร์ ผลิตภัณฑ์ หรือบริการเพิ่มเติมที่เรานำเสนอในบริการ (รวมเรียกว่า "ข้อตกลง") หากคุณไม่ยอมรับและไม่ตกลงที่จะเข้าผูกพันตามข้อกำหนดของข้อตกลงนี้ โปรดอย่าใช้บริการนี้ {'\n'}
เราอาจจะทำการเปลี่ยนแปลงข้อมูลในข้อตกลงนี้และในบริการเป็นครั้งคราว เราอาจจะดำเนินการดังกล่าวด้วยเหตุผลที่หลากหลาย รวมถึงการทำให้สอดคล้องกับการเปลี่ยนแปลงหรือข้อกำหนดที่มีในกฎหมาย คุณลักษณะใหม่ ๆ หรือการเปลี่ยนแปลงในแนวปฏิบัติทางธุรกิจ ข้อตกลงเวอร์ชันล่าสุดจะได้รับการประกาศไว้บนบริการ ภายใต้หัวข้อการตั้งค่า และยังมีอยู่ที่ MaJoy.co และคุณควรตรวจสอบเวอร์ชันที่เป็นปัจจุบันที่สุดอยู่เสมอ เวอร์ชันล่าสุดคือเวอร์ชันที่จะมีผลบังคับใช้ ถ้าหากการเปลี่ยนแปลงรวมถึงการเปลี่ยนแปลงเนื้อหาในสาระสำคัญที่จะส่งผลกระทบต่อสิทธิหรือพันธะผูกพันของคุณ เราจะแจ้งให้คุณทราบล่วงหน้าถึงการเปลี่ยนแปลงด้วยวิธีการที่เหมาะสม รวมถึงการแจ้งเตือนผ่านบริการหรือทางอีเมล หากคุณยังใช้บริการต่อไปหลังจากการเปลี่ยนแปลงมีผล นั่นหมายถึงคุณยอมรับในข้อตกลงที่มีการแก้ไขปรับปรุง</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>2. การมีคุณสมบัติตามเกณฑ์</Text>
                            <Text style={[styles.inputLabel4]}>คุณต้องมีอายุอย่างน้อย 18 ปีบริบูรณ์ในการสร้างบัญชีกับ MaJoy และใช้บริการ โดยการสร้างบัญชีและใช้บริการนั้น หมายถึงคุณได้ให้คำรับรองและรับประกันว่า:
                            {'\n'}      •     คุณสามารถสร้างสัญญาผูกพันกับ MaJoy ได้
                            {'\n'}      •     คุณไม่ใช่บุคคลที่ถูกสั่งห้ามไม่ให้ใช้บริการภายใต้กฎหมายของสหรัฐอเมริกา หรือภายใต้เขตอำนาจทางกฎหมายอื่นใดที่มี – ซึ่งหมายความว่าคุณไม่ได้มีชื่ออยู่บนบัญชีรายชื่อประเทศที่ถูกจับตามองเป็นพิเศษ (Specially Designated Nationals) ของกระทรวงการคลังแห่งสหรัฐอเมริกา หรือถูกต้องห้ามในลักษณะที่คล้ายคลึงกันอื่นใด
                            {'\n'}      •     คุณจะปฏิบัติตามข้อตกลงนี้ และกฎหมาย ระเบียบและข้อบังคับทั้งของท้องถิ่น รัฐ ประเทศ และระหว่างประเทศทั้งหมดที่มีบังคับใช้ และ
                            {'\n'}      •     คุณไม่เคยถูกพิพากษาถึงความผิดอาญาอุกฉกรรจ์ (หรืออาชญากรรมที่มีความรุนแรงคล้ายคลึงกัน) อาชญากรรมทางเพศ หรืออาชญากรรมที่เกี่ยวกับความรุนแรง และไม่อยู่ในบัญชีผู้กระทำผิดทางเพศในรัฐ รัฐบาลกลาง หรือบัญชีทะเบียนผู้กระทำผิดทางเพศในท้องถิ่นใด ๆ</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>3. บัญชีของคุณ</Text>
                            <Text style={[styles.inputLabel4]}>ในการใช้งาน MaJoy คุณอาจจะต้องลงชื่อเข้าใช้โดยใช้ข้อมูลการเข้าสู่ระบบ เบอร์มือถือของคุณ หากคุณดำเนินการเช่นนั้น จะหมายความว่าคุณอนุญาตให้เราเข้าถึงและใช้ข้อมูลบางส่วนจากบัญชี เบอร์มือถือของคุณ สำหรับรายละเอียดเพิ่มเติมเกี่ยวกับข้อมูลที่เราเก็บรวบรวมจากคุณและวิธีการที่เราใช้ข้อมูล กรุณาศึกษาได้จากนโยบายความเป็นส่วนตัวของเรา{'\n'}
การรักษาความลับของข้อมูลการล็อกอินที่คุณใช้เพื่อสมัครเข้าสู่ระบบของ MaJoy ถือเป็นความรับผิดชอบของคุณ และคุณเป็นผู้รับผิดชอบสำหรับกิจกรรมทั้งหมดที่เกิดขึ้นภายใต้ข้อมูลประจำตัวเหล่านั้นแต่เพียงผู้เดียว หากคุณสงสัยว่ามีคนเข้าถึงบัญชีของคุณ โปรด ติดต่อเรา ทันที</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>4. การแก้ไขเปลี่ยนแปลงบริการและการยกเลิกการใช้งาน</Text>
                            <Text style={[styles.inputLabel4]}>MaJoy มุ่งมั่นเสมอที่จะพัฒนาปรับปรุงบริการ และนำเสนอการใช้งานเพิ่มเติมที่คุณจะได้มีส่วนร่วมมากขึ้นและมีประโยชน์ นั่นหมายความว่า เราอาจจะเพิ่มคุณลักษณะหรือการปรับปรุงใหม่ ๆ ในผลิตภัณฑ์เป็นครั้งคราว เช่นเดียวกับการลบคุณลักษณะบางอย่าง และหากการดำเนินนั้นไม่ได้มีผลสำคัญต่อสิทธิหรือพันธะผูกพันของคุณ เราอาจจะไม่ได้แจ้งให้คุณทราบก่อนดำเนินการแก้ไขเปลี่ยนแปลง เราอาจจะระงับบริการทั้งหมดได้ ซึ่งในกรณีนี้ เราจะแจ้งให้คุณทราบล่วงหน้า เว้นแต่จะอยู่ภายใต้เหตุขัดข้อง เช่น ปัญหาด้านความปลอดภัยหรือการรักษาความปลอดภัย ที่จะยับยั้งไม่ให้เราแจ้งให้คุณทราบ{'\n'}
คุณอาจยกเลิกบัญชีได้ทุกเวลาและไม่ว่าด้วยเหตุผลใดก็ตามด้วยการปฏิบัติตามคำแนะนำที่ระบุใน "การตั้งค่า" ในบริการนี้ อย่างไรก็ตาม หากคุณใช้บัญชีการชำระเงินผ่านบุคคลที่สาม คุณจะต้องจัดการการซื้อภายในแอปผ่านบัญชีดังกล่าว (เช่น iTunes, Google Play) เพื่อหลีกเลี่ยงการเรียกเก็บเงินเพิ่มเติม MaJoy อาจยกเลิกบัญชีของคุณเมื่อใดก็ได้โดยไม่ต้องแจ้งให้ทราบล่วงหน้า หากเราเชื่อว่าคุณได้ละเมิดข้อตกลงฉบับนี้ เมื่อมีการยกเลิกการใช้งาน คุณจะไม่มีสิทธิได้รับเงินจากการซื้อภายในแอปคืน หลังจากบัญชีถูกยกเลิกแล้ว ให้ถือว่าข้อตกลงนี้เป็นอันสิ้นสุดเช่นกัน ยกเว้นข้อกำหนดที่จะยังคงมีผลบังคับใช้ระหว่างคุณและ MaJoy ต่อไปนี้ ข้อ 4, 5 และข้อ 12 ถึงข้อ 19</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>5. ความปลอดภัยว่าด้วยการมีปฏิสัมพันธ์กับสมาชิกท่านอื่น</Text>
                            <Text style={[styles.inputLabel4]}>แม้ MaJoy จะมุ่งมั่นส่งเสริมให้เกิดประสบการณ์ของสมาชิกที่มีความเคารพซึ่งกันและกันผ่านฟีเจอร์ต่าง ๆ เช่น การเลือกเข้าร่วมของทั้งสองฝ่ายซึ่งจะให้สมาชิกสื่อสารกันได้เฉพาะหลังจากที่ทั้งสองฝ่ายต่างสนใจในกันและกันเท่านั้น แต่ทางเรา จะไม่รับผิดชอบต่อพฤติกรรมของสมาชิก ทั้งภายในและภายนอกบริการนี้ คุณตกลงที่จะใช้ความระมัดระวังในการมีปฏิสัมพันธ์กับสมาชิกท่านอื่น โดยเฉพาะอย่างยิ่งหากคุณตัดสินใจจะติดต่อสื่อสารนอกบริการนี้ หรือนัดพบปะเป็นการส่วนตัว นอกจากนี้ คุณตกลงที่จะศึกษาและปฏิบัติตามเคล็ดลับด้านความปลอดภัยของ MaJoy ก่อนใช้บริการนี้ คุณตกลงที่จะไม่มอบข้อมูลทางการเงิน (เช่น ข้อมูลบัตรเครดิต หรือบัญชีธนาคาร) หรือโอนเงิน หรือส่งเงินด้วยวิธีการอื่นใดแก่สมาชิกท่านอื่น
คุณจะรับผิดชอบต่อการมีปฏิสัมพันธ์กับสมาชิกท่านอื่นแต่เพียงผู้เดียว คุณเข้าใจดีว่า MaJoy ไม่ได้ ดำเนินการตรวจสอบประวัติอาชญากรรมของสมาชิก และไม่ได้ทำการตรวจสอบภูมิหลังของสมาชิก MaJoy ไม่รับรองหรือรับประกันพฤติกรรมของสมาชิก</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>6. สิทธิที่ MaJoy มอบให้คุณ</Text>
                            <Text style={[styles.inputLabel4]}>MaJoy อนุญาตให้คุณเข้าถึงและใช้บริการได้เป็นการส่วนตัว ทั่วโลก ไม่ต้องมีการกำหนดมอบหมาย ไม่เป็นเอกสิทธิ์พิเศษ เพิกถอนได้ และไม่สามารถนำไปอนุญาตช่วงได้ การอนุญาตนี้จะเป็นไปตามวัตถุประสงค์ของการให้คุณใช้และเพลิดเพลินกับประโยชน์จากบริการเท่านั้น ตามเจตนาของ MaJoy และตามที่ข้อตกลงฉบับนี้อนุญาตไว้ ดังนั้น คุณยินยอมว่าจะไม่:{'\n'}
                                {'\n'}      •     ใช้บริการหรือเนื้อหาใด ๆ ที่มีอยู่ในบริการ เพื่อวัตถุประสงค์ทางการค้าใด ๆ โดยไม่ได้ความยินยอมเป็นลายลักษณ์อักษรจากเรา
                            {'\n'}      •     คัดลอก แก้ไข ส่งต่อ สร้างผลงานเลียนแบบ ใช้ประโยชน์ หรือผลิตซ้ำซึ่งเนื้อหา รูปภาพ เครื่องหมายการค้า ชื่อการค้า เครื่องหมายบริการ หรือทรัพย์สินทางปัญญา เนื้อหา หรือข้อมูลกรรมสิทธิ์อื่นใดที่มีลิขสิทธิ์ และเข้าถึงได้ผ่านบริการ ไม่ว่าในทางใด ๆ โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจาก MaJoy
                            {'\n'}      •     แสดงออกโดยชัดแจ้งหรือแสดงเป็นนัยว่าข้อความที่คุณสร้างขึ้นนั้นได้รับการรับรองโดย MaJoy
                            {'\n'}      •     ใช้โรบอต บอต สไปเดอร์ ครอว์เลอร์ สเครปเปอร์ แอปพลิเคชันค้นหาเว็บไซต์/เรียกดูข้อมูล พร็อกซี่ หรืออุปกรณ์ที่ดำเนินการด้วยตัวเองหรืออัตโนมัติอื่น ๆ วิธีการหรือกระบวนการใด ๆ เพื่อเข้าถึง เรียกดู ทำดัชนี "การทำเหมืองข้อมูล" หรือในวิธีการใด ๆ ก็ตามที่เป็นการผลิตซ้ำหรือหลบเลี่ยงโครงสร้างการนำทางหรือการนำเสนอของบริการ หรือเนื้อหาของบริการ
                            {'\n'}      •     ใช้บริการในวิธีที่อาจจะแทรกแทรง ขัดขวาง หรือส่งผลกระทบในเชิงลบต่อบริการ หรือเซิร์ฟเวอร์หรือเครือข่ายที่เชื่อมต่อกับบริการ
                            {'\n'}      •     อัปโหลดไวรัสหรือรหัสที่เป็นอันตรายอื่น ๆ หรือทำอันตรายต่อการรักษาความปลอดภัยของบริการ
                            {'\n'}      •     ปลอมแปลงหัวเรื่องหรือปรับเปลี่ยนตัวระบุตัวตน เพื่อจะอำพรางต้นตอข้อมูลใด ๆ ที่ส่งไปยังหรือผ่านบริการ
                            {'\n'}      •     "เฟรม" หรือ "มิร์เรอร์" ส่วนหนึ่งส่วนใดของบริการโดยไม่ได้รับการอนุญาตเป็นลายลักษณ์อักษรล่วงหน้าจาก MaJoy
                            {'\n'}      •     ใช้เมกาแท็กหรือรหัส หรืออุปกรณ์อื่น ๆ ที่มีการอ้างอิงใด ๆ ถึง MaJoy หรือบริการ (หรือเครื่องหมายการค้า ชื่อการค้า เครื่องหมายบริการ โลโก้ หรือสโลแกนของ MaJoy) เพื่อส่งบุคคลใด ๆ ไปยังเว็บไซต์ใด ๆ เพื่อวัตถุประสงค์ใด ๆ ก็ตาม
                            {'\n'}      •     แก้ไข ดัดแปลง มอบอนุญาตช่วง แปล ขาย ใช้วิศวกรรมย้อนกลับ ถอดรหัส แปลกลับ หรือแยกส่วนใด ๆ ของบริการ หรือเป็นเหตุให้ผู้อื่นกระทำการดังกล่าว
                            {'\n'}      •     ใช้หรือพัฒนาแอปพลิเคชันของบุคคลที่สามใด ๆ ที่จะติดต่อโต้ตอบกับบริการ หรือเนื้อหาหรือข้อมูลของสมาชิกท่านอื่น ๆ โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากเรา
                            {'\n'}      •     ใช้ เข้าถึง หรือเผยแพร่ส่วนติดต่อการเขียนโปรแกรมของแอปพลิเคชัน MaJoy โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรจากเรา
                            {'\n'}      •     ตรวจสอบ สแกน หรือทดสอบความเปราะบางของบริการของเรา หรือระบบ หรือเครือข่ายใด ๆ
                            {'\n'}      •     ส่งเสริมหรือสนับสนุนกิจกรรมใด ๆ ที่ฝ่าฝืนข้อตกลงฉบับนี้
                            {'\n'}เราอาจสืบสวนและดำเนินคดีทางกฎหมายตามที่มีใด ๆ ต่อการใช้บริการโดยไม่ชอบด้วยกฎหมาย และ/หรือ ไม่ได้รับอนุญาต รวมถึงการยกเลิกบัญชีของคุณ
ซอฟต์แวร์ใด ๆ ที่เราจัดหาไว้ให้คุณ อาจจะดาวน์โหลดและติดตั้งการอัปเกรด อัปเดต หรือคุณลักษณะใหม่ ๆ เองโดยอัตโนมัติ คุณอาจจะแก้ไขการดาวน์โหลดอัตโนมัติเหล่านี้ได้ผ่านการตั้งค่าในอุปกรณ์ของคุณ</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>7. สิทธิที่คุณมอบแก่ MaJoy</Text>
                            <Text style={[styles.inputLabel4]}>ด้วยการสร้างบัญชี คุณอนุญาตให้ MaJoy มีสิทธิ์ในการถ่ายโอน อนุญาตช่วง สัมปทาน มีสิทธิ์และออกใบอนุญาตเพื่อโฮสต์ จัดเก็บ ใช้งาน ทำสำเนา แสดง ทำซ้ำ เปลี่ยนแปลง แก้ไข เผยแพร่ ดัดแปลง และแจกจ่ายข้อมูลที่คุณอนุญาต (รวมเรียกว่า "โพสต์") ในบริการ หรือส่งต่อให้กับสมาชิกท่านอื่น ๆ (รวมเรียกว่า "เนื้อหา") ได้ ใบอนุญาตของ MaJoy สำหรับเนื้อหาของคุณนั้นเป็นแบบไม่ผูกขาด นอกเสียจาก ใบอนุญาตของ MaJoy นั้นจะมีสิทธิ์เฉพาะสำหรับงานที่ถูกสร้างขึ้นโดยการใช้บริการ ตัวอย่างเช่น MaJoy จะมีใบอนุญาตเฉพาะสำหรับการจับภาพหน้าจอของบริการที่มีเนื้อหาของคุณอยู่ นอกจากนี้ เพื่อให้ MaJoy สามารถป้องกันการใช้เนื้อหาของคุณนอกบริการได้ คุณได้อนุญาตให้ MaJoy สามารถดำเนินการในนามของคุณเกี่ยวกับการละเมิดการใช้งานเนื้อหาของคุณจากบริการโดยสมาชิกท่านอื่นหรือบุคคลที่สามได้ โดยเจตนานี้ครอบคลุมถึงอำนาจ แต่ไม่ได้เป็นข้อผูกมัด ในการส่งหนังสือแจ้งตามข้อกำหนด 17 U.S.C. § 512(c)(3) (กล่าวคือ หนังสือแจ้งการเพิกถอน DMCA) ในนามของคุณ หากเนื้อหาของคุณถูกนำมาใช้ และเป็นการใช้โดยบุคคลที่สามนอกบริการ การอนุญาตของเราในการใช้เนื้อหาของคุณถือเป็นสิทธิ์ของคุณ ภายใต้กฎหมายที่บังคับใช้ (ตัวอย่างเช่น กฎหมายที่เกี่ยวกับการปกป้องข้อมูลส่วนบุคคลตามขอบเขตเนื้อหาใด ๆ ที่มีข้อมูลส่วนบุคคลตามที่กำหนดไว้ในกฎหมายเหล่านั้น) และเพื่อวัตถุประสงค์เฉพาะในการดำเนินงาน การสร้าง การจัดหา และการปรับปรุงการบริการ และการวิจัยและพัฒนาใหม่ ๆ คุณยอมรับว่า สมาชิกท่านอื่น ๆ และบุคคลอื่นสามารถเข้าชมหรือเข้าร่วมในบริการ เนื้อหาใด ๆ ที่คุณวาง หรือที่คุณให้สิทธิ์แก่เราในการให้บริการ (เช่น บุคคลอื่นที่อาจได้รับเนื้อหาที่แชร์มาจากสมาชิก MaJoy คนอื่น ๆ)
                            คุณรับรองว่าข้อมูลทั้งหมดที่คุณนำส่งตอนสร้างบัญชีของคุณ รวมถึงข้อมูลที่นำส่งจากบัญชี Facebook ของคุณ มีความถูกต้องและเป็นจริง และคุณมีสิทธิในการโพสต์เนื้อหาบนบริการ และมอบการอนุญาตให้แก่ MaJoy ตามข้างต้น
                            คุณเข้าใจและยอมรับว่า เราอาจติดตามหรือตรวจสอบเนื้อหาใด ๆ ที่คุณโพสต์ ในฐานะที่เป็นส่วนหนึ่งของบริการ เราอาจจะลบเนื้อหาใด ๆ ไม่ว่าจะทั้งหมดหรือบางส่วน ตามที่ดุลยพินิจของเราแต่เพียงผู้เดียวพิจารณาแล้วว่า เป็นการฝ่าฝืนข้อตกลงฉบับนี้ หรืออาจจะเป็นอันตรายต่อชื่อเสียงของบริการ
                            เมื่อต้องสื่อสารกับตัวแทนฝ่ายดูแลลูกค้าของเรา คุณตกลงที่จะให้ความเคารพและแสดงออกอย่างนุ่มนวล หากเรารู้สึกว่าพฤติกรรมของคุณ ที่มีต่อตัวแทนฝ่ายดูแลลูกค้าคนใดของเราหรือพนักงานของเรา เป็นการคุกคามหรือก้าวร้าว ไม่ว่าในเวลาไหนก็ตาม เราขอสงวนสิทธิ์ในยกเลิกบัญชีของคุณโดยทันที
                            เพื่อเป็นการตอบแทนที่ MaJoy อนุญาตให้คุณใช้บริการ คุณยินยอมให้เรา เราในเครือของเรา และพันธมิตรบุคคลที่สามของเรา อาจแสดงโฆษณาในบริการ โดยการส่งคำแนะนำหรือความคิดเห็นให้แก่ MaJoy เกี่ยวกับบริการของเรา จะหมายความว่าคุณยินยอมว่า MaJoy อาจจะใช้และแบ่งปันความคิดเห็นดังกล่าว เพื่อวัตถุประสงค์ใด ๆ โดยไม่จ่ายค่าตอบแทนให้คุณ
โปรดทราบว่า ในการทำข้อตกลงนี้กับคุณ MaJoy อาจเข้าถึง จัดเก็บ และเปิดเผยข้อมูลบัญชีและเนื้อหาของคุณตามที่กฎหมายกำหนด หรือกระทำด้วยความเชื่อโดยสุจริตว่า การเข้าถึง จัดเก็บ หรือเปิดเผยดังกล่าวชอบด้วยกฎหมาย เช่น {'\n'}(1) การปฏิบัติตามกระบวนการทางกฎหมาย {'\n'}(2) การบังคับใช้ตามข้อตกลงฉบับนี้ {'\n'}(3) การกระทำตามข้อร้องเรียนว่ามีเนื้อหาที่ละเมิดสิทธิของบุคคลที่สาม {'\n'}(4) การกระทำตามคำร้องขอของคุณว่าด้วยการบริการลูกค้า หรือ {'\n'}(5) การปกป้องสิทธิ ทรัพย์สิน หรือความปลอดภัยส่วนบุคคลของเรา หรือบุคคลอื่น</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>8. กฎเกณฑ์ของชุมชน</Text>
                            <Text style={[styles.inputLabel4]}>โดยการใช้บริการนี้ หมายความว่าคุณยินยอมที่จะไม่:{'\n'}
                                {'\n'}      •     ใช้บริการเพื่อวัตถุประสงค์ใด ๆ ที่ไม่ชอบด้วยกฎหมายหรือเป็นสิ่งต้องห้ามตามข้อตกลงฉบับนี้
                            {'\n'}      •     ใช้บริการเพื่อวัตถุประสงค์ที่เป็นอันตรายหรือชั่วร้ายใด ๆ
                            {'\n'}      •     ใช้บริการเพื่อทำลาย MaJoy
                            {'\n'}      •     ละเมิด หลักเกณฑ์ของชุมชน ของเรา ซึ่งได้รับการปรับปรุงเป็นครั้งคราว
                            {'\n'}      •     สร้างสแปม เรียกร้องเงินจากผู้ใช้ หรือล่อลวงสมาชิกท่านอื่น
                            {'\n'}      •     ปลอมเป็นบุคคลหรือนิติบุคคลใด ๆ หรือโพสต์รูปภาพใด ๆ ของบุคคลอื่นโดยไม่ได้รับอนุญาตจากเขาหรือเธอ
                            {'\n'}      •     กลั่นแกล้ง "ไล่ตาม" ข่มขู่ ทำร้ายร่างกาย คุกคาม ทารุณ หรือหมิ่นประมาทบุคคลใด ๆ
                            {'\n'}      •     โพสต์เนื้อหาใด ๆ ที่ฝ่าฝืนหรือละเมิดสิทธิของผู้ใดผู้หนึ่ง รวมถึงสิทธิของการเผยแพร่ประชาสัมพันธ์ ความเป็นส่วนตัว ลิขสิทธิ์ เครื่องหมายการค้า หรือทรัพย์สินทางปัญญาหรือสิทธิในทางสัญญาอื่น ๆ
                            {'\n'}      •     โพสต์เนื้อหาใด ๆ ที่เป็นประทุษวาจา เป็นการคุกคาม ส่ออย่างชัดเจนถึงเรื่องเพศ หรือเป็นเรื่องลามกอนาจาร ยุยงปลุกปั่นให้เกิดความรุนแรง หรือมีการเปลือยกายหรือเป็นความรุนแรงทางภาพ หรือความรุนแรงที่ไม่มีความจำเป็น
                            {'\n'}      •     การโพสต์เนื้อหาใด ๆ ที่ส่งเสริมการเหยียดผิว ลัทธิ ความเกลียดชัง หรือความเสียหายทางกายภาพใด ๆ กับกลุ่มหรือบุคคลใด ๆ
                            {'\n'}      •     เรียกร้องขอรหัสผ่านเพื่อวัตถุประสงค์ใด ๆ หรือขอข้อมูลระบุตัวตนเพื่อวัตถุประสงค์ในเชิงพาณิชย์ หรือวัตถุประสงค์ที่ไม่ชอบด้วยกฎหมายจากสมาชิกท่านอื่น ๆ หรือเผยแพร่ข้อมูลส่วนบุคคลของบุคคลอื่น โดยไม่ได้รับอนุญาตจากเขาหรือเธอ
                            {'\n'}      •     ใช้บัญชีของสมาชิกท่านอื่น ใช้บัญชีร่วมกับสมาชิกท่านอื่น หรือมีมากกว่าหนึ่งบัญชี
                            {'\n'}      •     สร้างบัญชีอื่นขึ้นมา หากเราได้ยกเลิกบัญชีของคุณไปแล้ว เว้นแต่จะได้รับอนุญาตจากเรา
MaJoy ขอสงวนสิทธิในการสืบสวนและ/หรือยกเลิกบัญชีของคุณ โดยไม่มีการคืนเงินสำหรับการซื้อในแอปใด ๆ หากคุณได้ละเมิดข้อตกลงนี้ ใช้บริการในทางที่ผิด หรือประพฤติในทางที่ MaJoy เห็นว่าไม่เหมาะสมหรือผิดกฎหมาย รวมถึงการกระทำการหรือการสื่อสารที่เกิดขึ้นในหรือนอกบริการ</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>9. เนื้อหาของสมาชิกท่านอื่น</Text>
                            <Text style={[styles.inputLabel4]}>แม้ว่า MaJoy จะสงวนสิทธิ์ในการตรวจสอบและลบเนื้อหาที่ละเมิดข้อตกลงฉบับนี้ เนื้อหาดังกล่าวเป็นความรับผิดชอบของสมาชิกที่ทำการโพสต์แต่เพียงผู้เดียว และ MaJoy ไม่สามารถรับประกันได้ว่าเนื้อหาทั้งหมดจะเป็นไปตามข้อตกลงนี้ หากคุณเห็นเนื้อหาที่ละเมิดข้อตกลงนี้ โปรดรายงานภายในบริการหรือผ่าน แบบฟอร์มการติดต่อของเรา</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>10. การซื้อ</Text>
                            <Text style={[styles.inputLabel4]}>โดยทั่วไป MaJoy อาจนำเสนอผลิตภัณฑ์และบริการสำหรับการซื้อเป็นครั้งคราว ("การซื้อภายในแอป") ผ่าน iTunes, Google Play หรือการเรียกเก็บเงินผ่านผู้ให้บริการ การเรียกเก็บเงินโดยตรงจาก MaJoy หรือแพลตฟอร์มการชำระเงินอื่น ๆ ที่ได้รับอนุญาตจาก MaJoy หากคุณเลือกที่จะทำการซื้อภายในแอป คุณจะได้รับแจ้งให้ยืนยันการซื้อของคุณกับผู้ให้บริการชำระเงินที่เกี่ยวข้อง และวิธีการชำระเงินของคุณ (ไม่ว่าจะเป็นบัตรของคุณ หรือบัญชีของบุคคลที่สามเช่น Google Play หรือ iTunes) (เรียกว่า "วิธีการชำระเงิน" ของคุณ) จะถูกเรียกเก็บเงินสำหรับการซื้อภายในแอปตามราคาสำหรับบริการที่คุณเลือก รวมถึงภาษีการขายหรือภาษีอื่น ๆ ที่คล้ายกันที่อาจมีการเรียกเก็บรวมอยู่ในการชำระเงินของคุณ และคุณอนุญาตให้ MaJoy หรือบุคคลที่สามเรียกเก็บเงินจากคุณได้ หากคุณซื้อบริการสมาชิกที่มีการเรียกเก็บเงินโดยอัตโนมัติตามช่วงเวลาที่กำหนดผ่านการซื้อภายในแอป วิธีการชำระเงินของคุณจะถูกเรียกเก็บเงินค่าสมาชิกไปเรื่อยๆ จนกว่าจะทำการยกเลิก หลังพ้นระยะผูกพันของการสมัครสมาชิกเริ่มแรก และอีกครั้งหลังจากช่วงเวลาการต่ออายุสมาชิก ระบบจะต่ออายุสมาชิกให้คุณโดยอัตโนมัติตามระยะอายุสมาชิกเดิม ในราคาที่คุณตกลงไว้ขณะสมัครสมาชิก{'\n'}
การต่ออายุอัตโนมัติและการชำระบัตรอัตโนมัติ
ระบบจะต่ออายุสมาชิกโดยอัตโนมัติจนกว่าคุณจะยุติหรือยกเลิกสมาชิก เมื่อคุณสมัครสมาชิก วิธีการชำระเงินของคุณจะถูกเรียกเก็บเงินรายเดือนล่วงหน้าภายใน 24 ชั่วโมงนับจากวันที่ซื้อครั้งแรกในราคาที่คุณตกลงไว้ขณะสมัครสมาชิก ข้อมูลการชำระเงินด้วยบัตรจะถูกจัดเก็บและใช้สำหรับการชำระเงินอัตโนมัติผ่านบัตรตามข้อตกลงนี้{'\n'}
หากต้องการคัดค้านการชำระเงินที่ได้ชำระไปแล้ว โปรดส่งคำร้องไปที่ฝ่ายสนับสนุนลูกค้า ในกรณีที่คุณถูกเรียกเก็บเงินโดยตรงจาก MaJoy หรือบัญชีบุคคลที่สามที่เกี่ยวข้อง เช่น iTunes นอกจากนี้ คุณยังทำการคัดค้านได้โดยติดต่อไปยังธนาคารหรือผู้ให้บริการการชำระเงินซึ่งสามารถให้ข้อมูลเพิ่มเติมเกี่ยวกับสิทธิของคุณ รวมถึงข้อจำกัดทางด้านเวลาด้วย{'\n'}
คุณอาจเพิกถอนความยินยอมให้ชำระเงินผ่านบัตรอัตโนมัติได้ทุกเมื่อโดยไม่มีเงื่อนไขใด ๆ โดยไปที่การตั้งค่าใน MaJoy หรือบัญชีบุคคลที่สามที่เกี่ยวข้อง แต่โปรดทราบว่า คุณยังต้องชำระยอดคงค้างที่เหลืออยู่
หากต้องการเปลี่ยนแปลงหรือยกเลิกสมาชิก คุณจะต้องล็อกอินเข้าในบัญชีบุคคลที่สามของคุณ (หรือ "การตั้งค่า" ใน MaJoy) และปฏิบัติตามวิธีการยุติหรือยกเลิกสมาชิก แม้จะลบบัญชีที่มีกับเรา หรือลบแอปพลิเคชัน MaJoy จากอุปกรณ์ของคุณแล้วก็ตาม การลบบัญชีของคุณใน MaJoy หรือการลบแอปพลิเคชัน MaJoy จากอุปกรณ์ของคุณ ไม่ถือเป็นการยุติหรือยกเลิกสมาชิกของคุณ MaJoy จะยังคงเรียกเก็บเงินทั้งหมดตามวิธีการชำระเงินของคุณ จนกว่าคุณจะยุติหรือยกเลิกสมาชิกใน MaJoy หรือผ่านบัญชีบุคคลที่สาม แล้วแต่กรณี หากยุติหรือยกเลิกสมาชิก คุณอาจยังใช้บริการสมาชิกได้จนกว่าจะสิ้นสุดอายุสมาชิกปัจจุบัน และระบบจะไม่ต่ออายุสมาชิกหลังอายุสมาชิกครั้งปัจจุบันสิ้นสุดลง{'\n'}
อาจมีการบังคับใช้ข้อกำหนดเพิ่มเติม หากคุณชำระกับ MaJoy โดยตรงตามวิธีการชำระเงินของคุณ หากคุณชำระเงินกับ MaJoy โดยตรง MaJoy อาจแก้ไขข้อผิดพลาดเรื่องการเรียกเก็บเงินหรือข้อผิดพลาดอื่น ๆ ที่ปรากฏได้แม้ว่าจะได้เรียกเก็บหรือได้รับการชำระเงินนั้นไปแล้วก็ตาม หากคุณเริ่มดำเนินการปฏิเสธการชำระเงินหรือขอเรียกการชำระเงินคืนด้วยวิธีการชำระเงินของคุณ MaJoy อาจยกเลิกบัญชีของคุณได้ทันทีตามดุลยพินิจของเรา แต่เพียงผู้เดียว{'\n'}
คุณอาจแก้ไขข้อมูลวิธีการชำระเงินได้โดยเข้า MaJoy และไปที่การตั้งค่า หากการชำระเงินนั้นยังไม่เสร็จสิ้น เนื่องจากบัตรหมดอายุ วงเงินไม่เพียงพอ หรือด้วยเหตุอื่นใด และคุณไม่ได้ทำการแก้ไขข้อมูลวิธีการชำระเงิน ยุติหรือยกเลิกสมาชิก ให้ถือว่าคุณยังคงต้องรับผิดชอบต่อยอดเงินที่ยังไม่ได้เรียกเก็บ และอนุญาตให้เรา ดำเนินการเรียกเก็บเงินตามวิธีการชำระเงินต่อไป เนื่องจากอาจมีการอัปเดตข้อมูลดังกล่าว ซึ่งอาจส่งผลให้มีการเปลี่ยนแปลงวันที่ในเรียกเก็บเงินได้ นอกจากนี้ คุณอนุญาตให้เรา ขอวันหมดอายุใหม่ หรือวันหมดอายุและหมายเลขบัตรเครดิตหรือเดบิตใบใหม่ที่ออกให้โดยผู้ออกบัตรเครดิตหรือบัตรเดบิตของคุณ เงื่อนไขในการชำระเงินของคุณจะขึ้นอยู่กับวิธีการชำระเงิน และอาจถูกกำหนดโดยข้อตกลงระหว่างคุณและสถาบันการเงิน ผู้ออกบัตรเครดิต หรือผู้ให้บริการอื่น ตามวิธีการชำระเงินที่คุณกำหนด หากคุณพำนักนอกทวีปอเมริกา คุณยินยอมให้ดำเนินการชำระเงินให้ MaJoy{'\n'}
Super Likes หรือไอเท็มเสมือนจริงอื่น ๆ บางครั้งคุณอาจซื้อสิทธิการใช้งานแบบจำกัด ส่วนบุคคล ไม่สามารถถ่ายโอนได้ ไม่สามารถโอนช่วงสิทธิได้ แต่เพิกถอนได้ เพื่อใช้ "ไอเท็มเสมือน" ซึ่งรวมถึงแต่ไม่จำกัดเพียง Super Likes (รวมเรียกว่า "ไอเท็มเสมือน") ยอดไอเท็มเสมือนคงเหลือที่ปรากฏในบัญชีของคุณไม่ถือเป็นยอดคงเหลือในโลกจริง และไม่ได้สะท้อนถึงมูลค่าที่เก็บไว้ แต่ถือเป็นหน่วยวัดขอบเขตของสิทธิการใช้งานของคุณ ไอเท็มเสมือนไม่มีการเรียกเก็บค่าธรรมเนียมหากไม่มีการใช้งาน อย่างไรก็ตาม สิทธิการใช้งานที่มอบให้คุณในไอเท็มเสมือนนั้นจะยุติลงตามเงื่อนไขที่ระบุในข้อตกลงนี้ เมื่อ MaJoy ยุติการให้บริการนี้ หรือในกรณีที่บัญชีของคุณถูกปิดหรือยกเลิก MaJoy ขอใช้ดุลยพินิจแต่เพียงฝ่ายเดียวในการสงวนสิทธิ์การเรียกเก็บค่าธรรมเนียมสำหรับสิทธิในการเข้าถึงหรือใช้ไอเท็มเสมือน และ/หรืออาจแจกจ่ายไอเท็มเสมือนโดยเรียกหรือไม่เรียกเก็บค่าใช้จ่าย MaJoy อาจจัดการ กำกับ ควบคุม เปลี่ยนแปลง หรือยกเลิกไอเท็มเสมือนเมื่อใดก็ได้ และจะไม่รับผิดชอบต่อคุณหรือบุคคลที่สามในกรณีที่ MaJoy ใช้สิทธิดังกล่าว ไอเท็มเสมือนใช้ได้ผ่านบริการนี้เท่านั้น การซื้อและการแลกใช้ไอเท็มเสมือนทั้งหมดที่กระทำผ่านบริการนี้ถือเป็นที่สิ้นสุด และไม่สามารถขอเงินคืนได้ ข้อกำหนดของไอเท็มเสมือนสำหรับใช้ในบริการนี้ คือบริการที่เริ่มมีผลทันทีที่มีการยอมรับการซื้อไอเท็มเสมือนดังกล่าว คุณรับทราบว่า MaJoy ไม่จำเป็นต้องคืนเงินในส่วนที่เกี่ยวกับไอเท็มเสมือนไม่ว่าด้วยเหตุผลใด และคุณจะไม่ได้รับเงินหรือค่าชดเชยอื่นสำหรับไอเท็มเสมือนที่ไม่ได้ใช้เมื่อปิดบัญชี ไม่ว่าบัญชีดังกล่าวจะถูกปิดด้วยความสมัครใจหรือไม่ก็ตาม
การคืนเงิน โดยทั่วไปแล้ว คุณจะขอเงินคืนสำหรับค่าใช้จ่ายในการซื้อทั้งหมดไม่ได้ และจะไม่มีการคืนเงินหรือเครดิตคืนให้สำหรับช่วงเวลาที่ใช้ไปบางส่วน เราอาจจะยกเว้นให้ หากการคืนเงินสำหรับการบอกรับเป็นสมาชิกแบบอื่น ๆ นั้นมีการร้องขอเข้ามาภายในสิบสี่วันภายหลังจากวันที่มีการทำธุรกรรม หรือหากกฎหมายในเขตอำนาจศาลของคุณกำหนดให้ต้องคืนเงิน
การซื้อไอเท็มเสมือนจริงจะถือเป็นอันสิ้นสุดและคืนเงินไม่ได้
ในการร้องขอเงินคืน:{'\n'}
Iหากคุณสมัครใช้งานโดยใช้ Apple ID ของคุณ Apple จะเป็นผู้จัดการเรื่องเงินคืนของคุณ มิใช่ MaJoy ในการร้องขอเงินคืน ให้ไปที่ iTunes คลิกที่ Apple ID ของคุณ จากนั้นเลือก "ประวัติการซื้อ" ค้นหารายการและเลือก "รายงานปัญหา" นอกจากนี้ คุณยังสามารถส่งคำร้องไปที่ https://getsupport.apple.com
ในกรณีที่คุณสมัครสมาชิกโดยใช้บัญชี Google Play Store หรือผ่าน MaJoy โดยตรง โปรดติดต่อฝ่ายดูแลลูกค้า พร้อมด้วยหมายเลขคำสั่งซื้อของคุณสำหรับ Google Play Store (หมายเลขคำสั่งซื้อนี้อยู่ในอีเมลยืนยันการสั่งซื้อหรือโดยการล็อกอินเข้าสู่ระบบ Google Wallet) หรือ MaJoy (ข้อมูลนี้อยู่ในอีเมลยืนยันการสั่งซื้อ){'\n'}
คุณไม่สามารถยกเลิกคำสั่งซื้อสำหรับการส่งมอบเนื้อหาดิจิทัลที่ไม่ได้ส่งมอบบนสื่อบันทึกทางกายภาพได้ หากว่ากระบวนการคำสั่งได้เริ่มขึ้นแล้วด้วยความยินยอมและการรับทราบของคุณล่วงหน้าอย่างชัดแจ้งของคุณว่า คุณจะเสียสิทธิในการยกเลิก ข้อกำหนดนี้ใช้บังคับกับการซื้อไอเท็มเสมือนด้วย ซึ่งหมายความว่าการซื้อดังกล่าวเป็นที่สิ้นสุดและไม่สามารถคืนเงินได้{'\n'}
การกำหนดราคา MaJoy ดำเนินธุรกิจระดับโลกและให้บริการแก่ชุมชนที่มีความหลากหลายของสมาชิก โครงสร้างการกำหนดราคาของเราอาจแตกต่างกันไปตามภูมิภาค ระยะเวลาในการสมัครสมาชิก ข้อเสนอรวมหลายบริการ โปรโมชั่นในแอปล่าสุด และปัจจัยอื่น ๆ เราทดสอบคุณสมบัติใหม่ ๆ และการกำหนดราคาต่าง ๆ เพื่อให้สมาชิกมีการใช้งานที่หลากหลายและมีตัวเลือกการชำระเงินที่มากขึ้น หากพวกเขาเลือกที่จะใช้งาน</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>11. หนังสือแจ้งและวิธีการดำเนินการยื่นคำร้องเรื่องการละเมิดลิขสิทธิ์</Text>
                            <Text style={[styles.inputLabel4]}>หากคุณเชื่อว่าผลงานของคุณถูกคัดลอกและโพสต์ไว้บนบริการ ในวิธีการที่ก่อให้เกิดการละเมิดลิขสิทธิ์ กรุณาส่งข้อมูลดังต่อไปนี้ไปให้ตัวแทนฝ่ายดูแลลิขสิทธิ์ (Copyright Agent) ของเรา:{'\n'}
                                {'\n'}      •     ลายมือชื่อแบบอิเล็กทรอนิกส์หรือลายมือชื่อที่เขียนด้วยปากกาของบุคคลที่ได้รับอนุญาตให้กระทำการในนามของผู้ถือผลประโยชน์ในลิขสิทธิ์
                            {'\n'}      •     คำอธิบายของงานลิขสิทธิ์ที่คุณอ้างว่าถูกละเมิด
                            {'\n'}      •     คำอธิบายว่าเนื้อหาที่คุณอ้างว่ามีการละเมิดนั้นอยู่ส่วนใดในบริการ (และคำอธิบายดังกล่าวจะต้องมีความเพียงพออย่างสมเหตุสมผล เพื่อช่วยให้เราค้นหาเนื้อหาที่ถูกกล่าวหาว่าละเมิดได้)
                            {'\n'}      •     ข้อมูลติดต่อของคุณ รวมถึงที่อยู่ หมายเลขโทรศัพท์ และอีเมล
                            {'\n'}      •     หนังสือแถลงความจากคุณที่ระบุว่าคุณมีความเชื่อโดยสุจริตใจว่า การใช้งานที่ขัดแย้งนั้น ไม่ได้รับอนุญาตจากเจ้าของลิขสิทธิ์ ตัวแทนของเจ้าของ หรือกฎหมาย และ
                            {'\n'}      •     คำแถลงของคุณ ที่ทำขึ้นภายใต้บทลงโทษการให้การเท็จ ว่าข้อมูลข้างต้นในใบแจ้งของคุณนั้นถูกต้องทุกประการ และคุณเป็นเจ้าของลิขสิทธิ์หรือผู้ได้รับอนุญาตให้กระทำการแทนเจ้าของลิขสิทธิ์</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>12. การปฏิเสธความรับผิด</Text>
                            <Text style={[styles.inputLabel4]}>MaJoy ให้บริการบนพื้นฐานของ "ลักษณะที่เป็น" และ "ตามที่มี" และตามขอบเขตที่กฎหมายที่มีอนุญาตไว้ เราจะไม่ให้การรับประกัน ไม่ว่าในรูปแบบใด ๆ ไม่ว่าจะเป็นไปโดยชัดแจ้ง โดยนัย โดยกฎหมาย ในส่วนที่เกี่ยวข้องกับบริการ (รวมถึงเนื้อหาทั้งหมดที่มีอยู่ในบริการนั้น) รวมถึงแต่ไม่จำกัดเพียงแต่ การรับประกันโดยนัยใด ๆ ถึงคุณภาพที่พึงพอใจ การแสวงหาประโยชน์ในเชิงพาณิชย์ ความเหมาะสมสำหรับวัตถุประสงค์เฉพาะด้าน หรือการไม่ละเมิดสิทธิ MaJoy ไม่รับรองหรือรับประกันว่า (ก) บริการจะไม่ถูกรบกวน มีความมั่นคง หรือปราศจากข้อผิดพลาด (ข) จะมีการแก้ไขข้อบกพร่องหรือข้อผิดพลาดใด ๆ ในบริการ หรือ (ค) เนื้อหาหรือข้อมูลใด ๆ ที่คุณได้รับผ่านบริการจะมีความถูกต้อง{'\n'}
MaJoy จะไม่รับผิดชอบต่อเนื้อหาใด ๆ ที่คุณ หรือสมาชิกท่านอื่น หรือบุคคลที่สามโพสต์ ส่ง หรือรับผ่านบริการ ในการเข้าถึงเนื้อหาใด ๆ ที่ดาวน์โหลดหรือได้รับมาผ่านการใช้บริการ คุณจะต้องใช้ดุลยพินิจและอยู่บนความเสี่ยงของคุณเอง</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>13. บริการของบุคคลที่สาม</Text>
                            <Text style={[styles.inputLabel4]}>บริการอาจจะมีเนื้อหาโฆษณาและการส่งเสริมการขายที่นำเสนอโดยบุคคลที่สาม และมีลิงก์ไปยังเว็บไซต์หรือแหล่งข้อมูลอื่น ๆ MaJoy ไม่รับผิดชอบต่อความพร้อมให้บริการ (หรือการขาดความพร้อมในการให้บริการ) ของเว็บไซต์หรือแหล่งข้อมูลภายนอกดังกล่าว หากคุณเลือกที่จะมีปฏิสัมพันธ์กับบุคคลที่สามที่มีผ่านบริการของเรา เงื่อนไขของฝ่ายดังกล่าวจะกำกับควบคุมความสัมพันธ์ที่มีกับคุณ MaJoy ไม่รับผิดชอบหรือรับผิดต่อเงื่อนไขหรือการกระทำการของบุคคลที่สามดังกล่าว</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>14. ข้อจำกัดความรับผิด</Text>
                            <Text style={[styles.inputLabel4]}>ภายใต้ขอบเขตสูงสุดที่กฎหมายที่มีอนุญาตไว้ ไม่ว่าในกรณีในก็ตาม MaJoy เราในเครือ พนักงาน ผู้ออกใบอนุญาต หรือผู้ให้บริการของเรา จะไม่รับผิดต่อความเสียหายที่เกิดขึ้นทางอ้อม เป็นผลสืบเนื่อง เป็นแบบอย่าง เกิดขึ้นโดยบังเอิญ เป็นการเฉพาะ หรือเพื่อลงโทษ รวมถึงแต่ไม่จำกัดเพียงแต่ การสูญเสียผลกำไร ไม่ว่าจะเกิดขึ้นโดยตรงหรือโดยอ้อม หรือการสูญเสียข้อมูลใด ๆ การใช้งาน ค่าความนิยม หรือการสูญเสียที่จับต้องไม่ได้อื่น ๆ อันเป็นผลมาจาก:{'\n'} (1) การเข้าถึง หรือการใช้ หรือการไม่สามารถเข้าถึง หรือไม่สามารถใช้บริการโดยคุณ{'\n'} (2) การกระทำการหรือเนื้อหาของสมาชิกท่านอื่น ๆ หรือบุคคลที่สามเกี่ยวกับ ผ่าน หรือที่เป็นผลสืบเนื่องจากการใช้บริการ หรือ {'\n'}(3) การเข้าถึง การใช้งาน หรือการแก้ไขเนื้อหาของคุณโดยไม่ได้รับอนุญาต หากแม้ว่า MaJoy จะได้รับแจ้งถึงโอกาสความเป็นไปได้ของความเสียหายดังกล่าวแล้วก็ตาม ไม่ว่าในกรณีใดก็ตาม ความรับผิดโดยรวมของ MaJoy ที่มีต่อคุณสำหรับข้อเรียกร้องทั้งหมดที่เกี่ยวข้องกับบริการ จะต้องไม่มากเกินกว่าจำนวนเงินที่คุณจ่ายให้แก่ MaJoy และ 100 เหรียญดอลล่าร์สหรัฐ สำหรับค่าบริการในขณะที่คุณยังมีบัญชีอยู่
เขตอำนาจทางกฎหมายบางแห่งไม่อนุญาตให้ละเว้นหรือจำกัดความเสียหายบางประการ ดังนั้น ข้อละเว้นและข้อจำกัดบางส่วนหรือทั้งหมดในหัวข้อนี้ อาจจะไม่มีผลใช้กับคุณ</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>15. อนุญาโตตุลาการ การสละสิทธิแห่งการฟ้องคดีแบบกลุ่ม และการสละสิทธิไม่ขอรับพิจารณาคดีด้วยคณะลูกขุน</Text>
                            <Text style={[styles.inputLabel4]}>ยกเว้นสำหรับสมาชิกที่พำนักอยู่ภายในสหภาพยุโรปหรือเขตเศรษฐกิจยุโรป และที่อื่น ๆ ที่กฎหมายที่มีได้ห้ามเอาไว้: {'\n'}
                                {'\n'}      1.      วิธีการเดียวในการระงับข้อพิพาทหรือข้อเรียกร้องที่เกิดขึ้นจากหรือเกี่ยวข้องกับข้อตกลงฉบับนี้ (รวมถึงข้อกล่าวหาการละเมิดฝ่าฝืนใด ๆ ในข้อตกลง) หรือบริการ จะต้องดำเนินการโดยวิธีการอนุญาโตตุลาการ ซึ่งได้รับการจัดการโดย JAMS ภายใต้กฎระเบียบและขั้นตอนการอนุญาโตตุลาการที่ได้รับการปรับปรุงแล้ว ยกเว้นตามที่ได้รับการแก้ไขโดย กระบวนการอนุญาโตตุลาการ ข้อยกเว้นเดียวของเอกสิทธิ์การอนุญาโตตุลาการคือ แต่ละฝ่ายมีสิทธิ์ในการฟ้องร้องแบบรายบุคคลต่ออีกฝ่ายหนึ่งในศาลคดีมโนสาเร่ของเขตอำนาจศาลที่มีอำนาจตัดสินคดี หรือต่ออนุญาโตตุลาการ ฝ่ายที่ต้องดำเนินการสามารถขอให้มีการพิจารณาข้อพิพาทในศาลคดีมโนสาเร่แทนหากว่าข้อพิพาทนั้นอยู่ในอำนาจศาลของศาลคดีมโนสาเร่ หากมีการร้องขอให้ดำเนินการในศาลคดีมโนสาเร่ก่อนที่จะมีการตั้งอนุญาโตตุลาการ อนุญาโตตุลาการจะถูกยกเลิกไป หากมีการร้องขอให้ดำเนินการในศาลคดีมโนสาเร่หลังจากที่ได้มีการตั้งอนุญาโตตุลาการไปแล้ว อนุญาโตตุลาการจะทำการตัดสินว่าข้อพิพาทดังกล่าวควรจะอยู่ในกระบวนการอนุญาโตตุลาการ หรือจะถูกตัดสินในศาลคดีมโนสาเร่แทน โดยคุณสามารถขอให้มีการอนุญาโตตุลาการดังกล่าวได้โดยการส่งคำร้องเป็นลายลักษณ์อักษรเท่านั้น เว้นแต่คุณหรือ MaJoy เลือกที่จะเรียกร้องสิทธิในการสอบปากเปล่าก่อนที่จะมีการอนุญาโตตุลาการ แต่ไม่ว่าคุณจะเลือกใช้การอนุญาโตตุลาการหรือการฟ้องร้องคดีในศาลคดีมโนสาเร่ คุณยอมรับว่า ไม่ว่าจะเป็นกรณีใดๆ ก็ตาม คุณจะไม่สามารถเริ่ม ดำเนินคดี หรือเข้าร่วมในลักษณะของการฟ้องคดีต่อเราในนามกลุ่มบุคคล การอนุญาโตตุลาการในนามกลุ่มบุคคล การฟ้องคดีในนามกลุ่มบุคคล หรือการดำเนินคดีต่อ MaJoy ได้
                            {'\n'}      2.      โดยการใช้บริการในทุกลักษณะ จะหมายความว่าคุณยอมรับในข้อตกลงเรื่องการอนุญาโตตุลาการข้างต้นแล้ว ในการกระทำการเช่นนั้นหมายถึง คุณได้สละในสิทธิ์แห่งการฟ้องร้องในศาลคดีมโนสาเร่ เพื่อยืนยันหรือคัดค้านข้อเรียกร้องใด ๆ ระหว่างคุณและเรา (ยกเว้นสำหรับเหตุที่อาจส่งฟ้องในศาลคดีมโนสาเร่ได้) และคุณยังได้สละสิทธิ์การเข้าร่วมการฟ้องคดีในนามกลุ่มบุคคล หรือการดำเนินคดีในนามกลุ่มบุคคลอื่น ๆ หากคุณเรียกร้องสิทธิ์ต่อ MaJoy นอกศาลคดีมโนสาเร่ (และ MaJoy ไม่ได้ร้องขอให้ย้ายคำร้องไปที่ศาลคดีมโนสาเร่) สิทธิ์ของคุณนั้นจะได้รับการพิจารณาโดยอนุญาโตตุลาการที่เป็นกลาง ไม่ใช่ผู้พิพากษาหรือคณะลูกขุน และอนุญาโตตุลาการจะตัดสินข้อเรียกร้องและข้อพิพาททั้งหมดที่เกี่ยวข้องกับอนุญาโตตุลาการ คุณมีสิทธิ์ได้รับการไต่สวนอย่างเป็นธรรมก่อนพบอนุญาโตตุลาการ อนุญาโตตุลาการสามารถสั่งการให้มีการแก้ไขเยียวยาได้เช่นเดียวกับศาล รวมถึงความสามารถในการพิจารณาคำร้อง (ซึ่งอาจรวมถึงคำร้องตามคำแถลงของคู่กรณี และคำร้องตามคำแถลงของคู่กรณีพร้อมพยานหลักฐานที่ส่งมา) แต่คุณควรทราบว่า กระบวนการพิจารณาตามการอนุญาโตตุลาการนั้น มักจะเรียบง่ายกว่า และดำเนินไปได้รวดเร็วกว่าการไต่สวนและกระบวนการพิจารณาเพื่อตัดสินอื่น ๆ ของศาล คำตัดสินของอนุญาโตตุลาการจะมีผลบังคับใช้ได้ในศาล และอาจจะถูกกลับคำตัดสินโดยศาลได้ด้วยเหตุผลที่จำกัดอย่างมากเท่านั้น สำหรับรายละเอียดเกี่ยวกับกระบวนการอนุญาโตตุลาการ โปรดดูที่ กระบวนการอนุญาโตตุลาการ
                            {'\n'}      3.      กระบวนการพิจารณาใด ๆ เพื่อบังคับใช้ข้อตกลงอนุญาโตตุลาการนี้ รวมถึงกระบวนการพิจารณาใด ๆ เพื่อยืนยัน แก้ไข หรือยกเลิกการมอบอนุญาโตตุลาการ อาจจะเริ่มต้นได้ในศาลใด ๆ ก็ตามของเขตปกครองทางกฎหมายที่มีอำนาจตัดสินคดีความ ในกรณีที่ข้อตกลงการอนุญาโตตุลาการมีขึ้นเพื่อเหตุผลใดก็ตาม ได้รับการพิจารณาว่าไม่สามารถบังคับใช้ได้ การฟ้องร้องใด ๆ ต่อเรา (ยกเว้นสำหรับการดำเนินคดีในศาลคดีมโนสาเร่) อาจจะกระทำได้เฉพาะในศาลรัฐบาลกลางหรือศาลประจำรัฐที่อยู่ในเมืองแดลลัส รัฐเท็กซัสเท่านั้น ในการนี้ คุณให้ความยินยอมโดยเพิกถอนมิได้ต่อเขตอำนาจทางกฎหมายของศาลเหล่านี้สำหรับวัตถุประสงค์ดังกล่าว
                            {'\n'}      4.      คุณสามารถใช้แพลตฟอร์มข้อตกลงการปฏิเสธทางออนไลน์ของ European Commission ทาง MaJoy ไม่มีส่วนเกี่ยวข้องกับขั้นตอนของการระงับข้อพิพาทโดยอนุญาโตตุลาการสำหรับสมาชิกที่พำนักอยู่ในสหภาพยุโรปหรือบริเวณเศรษฐกิจยุโรป</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>16. กฎหมายที่ใช้บังคับ</Text>
                            <Text style={[styles.inputLabel4]}>สำหรับสมาชิกที่พำนักอยู่ในสหภาพยุโรปหรือเขตเศรษฐกิจยุโรป หรือประเทศอื่น ๆ ที่กฎหมายห้ามใช้ข้อตกลงการอนุญาโตตุลาการของเรา กฎหมายของรัฐเท็กซัส ประเทศสหรัฐอเมริกา โดยไม่รวมถึงหลักการแห่งความขัดแย้งของข้อกฎหมายของรัฐเท็กซัส จะมีผลบังคับใช้กับข้อพิพาทใด ๆ ก็ตามที่เกิดขึ้นหรือเกี่ยวข้องกับข้อตกลงฉบับนี้หรือบริการ อย่างไรก็ตาม แม้จะมีข้อตกลงดังกล่าวข้างต้น ข้อตกลงอนุญาโตตุลาการในหัวข้อ 16 ข้างต้นจะอยู่ภายใต้บังคับแห่งพระราชบัญญัติอนุญาโตตุลาการของรัฐบาลกลาง (Federal Arbitration Act) เพื่อหลีกเลี่ยงข้อสงสัย ตัวเลือกการใช้กฎหมายควบคุมของรัฐเท็กซัสนั้น จะไม่มีอำนาจเหนือกว่ากฎหมายการคุ้มครองผู้บริโภคที่มีบังคับใช้ในเขตอำนาจทางกฎหมายดังกล่าว</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>17. สถานที่</Text>
                            <Text style={[styles.inputLabel4]}>นอกจากสมาชิกที่พำนักอยู่ในสหภาพยุโรป หรือเขตเศรษฐกิจยุโรป ซึ่งอาจนำข้อเรียกร้องไปใช้ในประเทศที่พำนักได้ตามกฎหมายที่ใช้บังคับ และยกเว้นการเรียกร้องที่อาจนำไปสู่การฟ้องร้องในศาลเล็ก ที่อาจได้รับค่าเสียหายจากศาลขนาดเล็ก การเรียกร้องทั้งหมดที่เกิดขึ้นจาก หรือเกี่ยวข้องกับข้อตกลงฉบับนี้ ต่อบริการ หรือความสัมพันธ์ของคุณกับ MaJoy ว่าด้วยเหตุผลใดก็ตาม จะไม่ถูกส่งไปยังอนุญาโตตุลาการ และจะถูกฟ้องร้องเฉพาะในศาลของรัฐบาลกลาง หรือดัลลัสเคาน์ตี้ รัฐเท็กซัส สหรัฐอเมริกาเท่านั้น คุณและ MaJoy ยินยอมให้มีการใช้เขตอำนาจศาลส่วนบุคคลของศาลในรัฐเท็กซัส และจะไม่ใช้สิทธิ์เรียกร้องใด ๆ ว่าศาลดังกล่าวเป็นศาลที่ไม่สะดวก</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>18. การชำระค่าสินไหมทดแทนโดยคุณ</Text>
                            <Text style={[styles.inputLabel4]}>คุณยินยอมว่า ภายใต้ขอบเขตที่กฎหมายที่มีอนุญาตไว้ จะชดใช้ ปกป้อง และไม่ฟ้องร้อง MaJoy เราในเครือของเรา และเจ้าหน้าที่ ผู้บริหาร ตัวแทน และพนักงานของพวกเขาและของเรา จากการร้องเรียน การเรียกร้อง การฟ้องร้อง ความเสียหาย การสูญเสีย ต้นทุน ความรับผิด และค่าใช้จ่ายใด ๆ และทั้งหมด รวมถึงค่าธรรมเนียมทนายความ ที่มีเหตุมาจาก เกิดขึ้นจาก หรือเกี่ยวข้องในทางใดทางหนึ่งกับ การเข้าถึงหรือใช้บริการของคุณ เนื้อหาของคุณ หรือการฝ่าฝืนข้อตกลงนี้ของคุณ</Text>
                        </View>
                        <View style={{ marginTop: 3 }}>
                            <Text style={styles.inputLabel4bold}>19. ข้อตกลงเบ็ดเสร็จและอื่น ๆ</Text>
                            <Text style={[styles.inputLabel4]}>ข้อตกลงนี้ พร้อมด้วย นโยบายความเป็นส่วนตัว นโยบายการใช้คุกกี้ คำแนะนำด้านความปลอดภัย กระบวนการอนุญาโตตุลาการ (หากเกี่ยวข้องกับคุณ) และเงื่อนไขใด ๆ ที่คุณได้รับแจ้งและยินยอมตกลง หากคุณซื้อคุณลักษณะ ผลิตภัณฑ์ หรือบริการที่เรานำเสนอไว้บนบริการเพิ่มเติม จะมีข้อตกลงเบ็ดเสร็จระหว่างคุณและ MaJoy เกี่ยวกับการใช้บริการอยู่ หากข้อกำหนดใด ๆ ของข้อตกลงฉบับนี้มีอันต้องเป็นโมฆะ เนื้อหาส่วนที่เหลือของข้อตกลง จะยังมีผลบังคับใช้อย่างเต็มที่และสมบูรณ์ทุกประการ การที่เราไม่สามารถใช้สิทธิ์หรือบังคับใช้สิทธิ์หรือข้อกำหนดใด ๆ ในข้อตกลงฉบับนี้ได้ จะไม่ถือว่าเป็นการสละซึ่งสิทธิ์หรือข้อกำหนดดังกล่าว คุณยินยอมว่าบัญชี MaJoy ของคุณจะโอนย้ายไม่ได้ และสิทธิ์ทั้งหมดของคุณในบัญชี รวมถึงเนื้อหาในบัญชี จะสิ้นสุดลงเมื่อคุณเสียชีวิต จะไม่มีเราตัวแทน ห้างหุ้นส่วน กิจการร่วมค้า ผู้ได้รับมอบหมายอำนาจ หรือความสัมพันธ์พิเศษอื่น ๆ หรือการจ้างงานใด ๆ ที่ถูกสร้างขึ้นอันเป็นผลมาจากข้อตกลงฉบับนี้ และคุณจะต้องไม่ให้คำรับรองหรือผูกพันในนามของ MaJoy ไม่ว่าจะเป็นในลักษณะใดก็ตาม</Text>
                        </View>
                    </View>


                    <View style={{ marginTop: 10, alignItems: 'center', marginBottom: 10 }}>
                        <CheckBox
                            title={<Text style={{ fontFamily: "sukhumvit-set" }}>  ข้าพเจ้ายอมรับ</Text>}
                            checkedColor={'#FF99CC'}
                            checked={this.state.checked}
                            onPress={() => this.setState({ checked: !this.state.checked })}
                        />
                        {this.state.checked == false ? 
                        <TouchableOpacity disabled={true}
                            style={[styles.button, {backgroundColor: '#ccc'}]}>
                            <Text style={styles.buttonText}>เสร็จสิ้น</Text>
                        </TouchableOpacity> 
                        : 
                        <TouchableOpacity onPress={() => this.props.navigation.navigate('Main')}
                            style={[styles.button, styles.buttonMobile]}>
                                <Text style={styles.buttonText}>เสร็จสิ้น</Text>
                            </TouchableOpacity>}

                    </View>
                </ScrollView>
            </View>
        );
    }
}

const styles = StyleSheet.create({
    container: {
        flex: 1,
        backgroundColor: '#fff',
    },
    developmentModeText: {
        marginBottom: 20,
        color: 'rgba(0,0,0,0.4)',
        fontSize: 14,
        lineHeight: 19,
        textAlign: 'center',
    },
    contentContainer: {
        paddingTop: 10,
    },
    viewInput: {
        // alignItems: 'center',
        marginHorizontal: 10,
    },
    getStartedContainer: {
        alignItems: 'center',
        position: 'absolute',
        bottom: 50,
        right: 0,
        left: 0
    },
    helpLink: {
        paddingVertical: 15,
    },
    helpLinkText: {
        fontSize: 14,
        color: '#2e78b7',
    },
    button: {
        height: 50,
        width: width * .8,
        marginTop: 10,
        alignItems: 'center',
        justifyContent: 'center',
        borderRadius: 5,
        shadowColor: "#000",
        shadowOffset: {
            width: 0,
            height: 2,
        },
        shadowOpacity: 0.25,
        shadowRadius: 3.84,

        elevation: 5,
    },
    buttonFacebook: {
        backgroundColor: '#3b5998',
    },
    buttonMobile: {
        backgroundColor: '#FF99CC',
    },
    buttonText: {
        fontSize: 18,
        color: '#fff',
        fontFamily: 'sukhumvit-set',
    },
    titleWrapper: {
        flex: 1,
        justifyContent: 'center',
        flexDirection: 'row',
    },
    title: {
        color: 'red',
        fontSize: 16,
        fontWeight: '800',
        paddingVertical: 30
    },
    wrapper: {
        marginTop: 30
    },
    inputWrapper1: {
        paddingVertical: 50,
        paddingHorizontal: 20,
        backgroundColor: '#009C92'
    },
    inputWrapper2: {
        paddingVertical: 50,
        paddingHorizontal: 20,
        // backgroundColor: '#E0F8F1'
    },
    inputWrapper3: {
        paddingVertical: 50,
        paddingHorizontal: 20,
        backgroundColor: '#2F0B3A'
    },
    inputLabel1: {
        color: '#fff',
        fontSize: 14,
        fontWeight: '800'
    },
    inputLabel2: {
        color: '#000',
        fontSize: 16,
        fontWeight: '800',
        fontFamily: 'sukhumvit-set',
    },
    inputLabel3: {
        color: '#000',
        fontSize: 24,
        fontWeight: '800',
        textAlign: 'center',
        fontFamily: 'sukhumvit-set-bold',
    },
    inputLabel4: {
        color: '#000',
        fontSize: 14,
        fontWeight: '800',
        fontFamily: 'sukhumvit-set',
    },
    inputLabel4bold: {
        color: '#000',
        fontSize: 16,
        fontWeight: '800',
        fontFamily: 'sukhumvit-set-bold',
    },
});